export const EVENT6 = [
  // 'APPEAL_CARD_GEN_PRICE\t100',
  // 'APPEAL_CARD_GEN_NEW_PRICE\t200',
  // 'APPEAL_CARD_UNLOCK\t0,20170914,0,20171014,0,20171116,0,20180201,0,20180607,0,20181206,0,20200326,0,20200611,4,10140732,6,10150431',
  'DEMOGAME_PLAY',
  'MATCHING_MODE',
  'MATCHING_MODE_FREE_IP',
  'LEVEL_LIMIT_EASING',
  'ACHIEVEMENT_ENABLE',
  'APICAGACHADRAW\t30',
  'VOLFORCE_ENABLE',
  'AKANAME_ENABLE',
  'PAUSE_ONLINEUPDATE',
  'CONTINUATION',
  'TENKAICHI_MODE',
  'QC_MODE',
  'KAC_MODE',
  'DISABLE_MONITOR_ID_CHECK',
  'FAVORITE_APPEALCARD_MAX\t200',
  'FAVORITE_MUSIC_MAX\t200',
  'STANDARD_UNLOCK_ENABLE',
  'PLAYERJUDGEADJ_ENABLE',
  'MIXID_INPUT_ENABLE',
  'DISP_PASELI_BANNER',
  'CHARACTER_IGNORE_DISABLE\t122,123,131,139,140,143,149,160,162,163,164,167,170,174,175',
  'STAMP_IGNORE_DISABLE\t273~312,773~820,993~1032,1245~1284,1469~1508,1585~1632,1633~1672,1737~1776,1777~1816,1897~1936,1937~1976',
  'SUBBG_IGNORE_DISABLE\t166~185,281~346,369~381,419~438,464~482,515~552,595~616,660~673,714~727,728~741',
  'BEGINNER_MUSIC_FOLDER\t56,78,80,86,87,91,111,128,134,275,278,180,697,770,769,779,842,948,940,1057,1056,1096,932,1136,1469,1480',
  'BEGINNER_MUSIC_FOLDER\t1471,1758,1753,1739,1867,1866,1860,1857,1903,1904,1859,1863,1856,1864,1865,1916,1917,1914,1915,1918,1960',
  'BEGINNER_MUSIC_FOLDER\t1961,1962,2029,2028,2030,2031,2035,2036,1905,1882,2058,2073,2070,2069,2074,2075,2067,2068,2066,2165,2166',
  'BEGINNER_MUSIC_FOLDER\t2174,2175,2193,2195,2196,2213,2216,2214,2215,2205,2206,2224,2229,2228,2230,2241,2244,2243,2242,2245,2240',
  'BEGINNER_MUSIC_FOLDER\t2251,2252,2220,2221,2289,2288,2291,2287,2290',
  'OMEGA_ENABLE\t1,2,3,4,5,6,7,8,9',
  'OMEGA_ARS_ENABLE',
  'HEXA_ENABLE\t1,2,3,4,5,6,7,8,9,10,11,12',
  'HEXA_OVERDRIVE_ENABLE\t8',
  'SKILL_ANALYZER_ABLE',
  'BLASTER_ABLE',
  'PREMIUM_TIME_ENABLE',
  'MEGAMIX_ENABLE',
  'ARENA_ENABLE',
  'ARENA_LOCAL_TO_ONLINE_ENABLE',
  'ARENA_ALTER_MODE_WINDOW_ENABLE',
  'ARENA_PASS_MATCH_WINDOW_ENABLE',
  'ARENA_VOTE_MODE_ENABLE',
  'ARENA_LOCAL_ULTIMATE_MATCH_ALWAYS',
  'MEGAMIX_BATTLE_MATCH_ENABLE',
  'DISABLED_MUSIC_IN_ARENA_ONLINE',
  'SINGLE_BATTLE_ENABLE',
  'GENERATOR_ABLE',
  'CREW_SELECT_ABLE',
  'VALGENE_ENABLE',
  'PLAYER_RADAR_ENABLE',
  'S_PUC_EFFECT_ENABLE',
  'FAVORITE_CREW_ENABLE',
  'TAMAADV_VALGENE_BONUS_ENABLE',
  'DEMOLOOP_INFORMATION\tdemo_info/250220_generator_pekora_demo.png',
  'ULTIMATE_MATCH_PLAYABLE_ALWAYS',
  'OVER_POWER_ENABLE'
]

export const LICENSED_SONGS6 = [
  158, 940, 1056, 1057, 1337, 1338, 1339, 1340, 1341, 1342, 
  1343, 1344, 1471, 1477, 1634, 1635, 1636, 1637, 1649, 1650, 
  1653, 1654, 1655, 1657, 1658, 1739, 1740, 1741, 1744, 1753, 
  1754, 1755, 1756, 1757, 1758, 1759, 1760, 1761, 1810, 1813, 
  1814, 1821, 1866, 1867, 1871, 1872, 1873, 1874, 1857, 1858, 
  1860, 1861, 1862, 1856, 1859, 1863, 1864, 1865, 1903, 1904, 
  1911, 1916, 1917, 1960, 1961, 1962, 2028, 2029, 1912, 1913, 
  2030, 2031, 2032, 2033, 2034, 2035, 2036, 1905, 1882, 2058, 
  2069, 2070, 2071, 2072, 2073, 2074, 2075, 2076, 2066, 2067, 
  2068, 2165, 2166, 2167, 2172, 2173, 2174, 2175, 2184, 2193, 
  2194, 2195, 2196, 2197, 2210, 2211, 2212, 2213, 2214, 2215,
  2216, 2217, 2218, 2219, 2205, 2206, 2207, 2208, 2224, 2176,
  2182, 2241, 2244, 2243, 2242, 2240, 2245, 2220, 2221, 2287,
  2288, 2289, 2290, 2291, 2192, 2228, 2229, 2230, 1734,

  // omnimix
  664, 1330, 1350, 1351, 1352, 1353, 1354, 1356, 1357, 1358,
  1355, 1359, 1446, 1447, 1448, 1449, 1453, 1454, 1455, 1456
]

export const VALKYRIE_SONGS = [
  2189, 2190, 2191, // triple tribe
]

export const APRILFOOLSSONGS = [
  840, 1219, 1751
]

export const UNLOCK_EVENTS6 = {
  'refillStamps': {
    '9': 5,
    '28': 10,
    '51': 10
  },
  'sdvx10thstamp': {
    'type': 'select',
    'info': {
      'id': 1,
      'stmpSlHd': '[sz:22][c:FFA6AA]SOUND VOLTEX 10th Anniversary',
      'stmpSlFt': '[sz:23]期間 2022/01/18～2022/03/21',
      'stmpHd': '[sz:22][c:DAC491]SPECIAL STAMP BONUS',
      'stmpFt': '[sz:22]YOU CAN GET A STAMP AND BONUS! :)[br:5]TERM: 1/18～3/21',
      'stmpBg': 'bg_stamp_anniversary_10th',
      'sheet': '1#sheet_track_1#e#1838,2#sheet_track_2#e#1839,3#sheet_track_3#e#1840,4#sheet_track_4#e#1841,5#sheet_track_5#e#1842,6#sheet_track_6#e#1843,7#sheet_track_7#e#1844',
      'data': [
        {
          'stmpid': 1,
          'stps': 5,
          'stprwrd': '5:e:183823'
        },
        {
          'stmpid': 2,
          'stps': 5,
          'stprwrd': '5:e:183923'
        },
        {
          'stmpid': 3,
          'stps': 5,
          'stprwrd': '5:e:184023'
        },
        {
          'stmpid': 4,
          'stps': 5,
          'stprwrd': '5:e:184123'
        },
        {
          'stmpid': 5,
          'stps': 5,
          'stprwrd': '5:e:184223'
        },
        {
          'stmpid': 6,
          'stps': 5,
          'stprwrd': '5:e:184323'
        },
        {
          'stmpid': 7,
          'stps': 5,
          'stprwrd': '5:e:184423'
        }
      ]
    }
  },
  'reflecstamp': {
    'type': 'main',
    'info': {
      'id': 0,
      'stmpHd': '[sz:22][c:DAC491]SPECIAL STAMP BONUS',
      'stmpFt': '[sz:22]YOU CAN GET A STAMP AND BONUS! :)[br:5]TERM: 3/30～5/8',
      'data': [
        {
          'stmpid': 8,
          'stps': 15,
          'stprwrd': '1:e:185323 3:e:185123 6:e:185223 10:e:185023 15:e:185423'
        }
      ]
    }
  },
  'pcbevent': {
    'type': 'main',
    'info': {
      'id': 0,
      'stmpHd': '[sz:22][c:DAC491]SPECIAL STAMP BONUS',
      'stmpFt': '[sz:22]YOU CAN GET A STAMP AND BONUS! :)[br:5]TERM: 12/8～1/15',
      'data': [
        {
          'stmpid': 9,
          'stps': 5,
          'stprwrd': '1:b:500 2:b:500 3:b:1000 4:b:1000 5:b:2000'
        }
      ]
    }
  },
  '2023stamp': {
    'type': 'main',
    'info': {
      'id': 0,
      'stmpHd': '[sz:22]SPECIAL STAMP BONUS',
      'stmpFt': '[sz:22]YOU CAN GET A STAMP AND BONUS! :)[br:5]TERM: 1/1～1/9',
      'data': [
        {
          'stmpid': 10,
          'stps': 1,
          'stprwrd': '1:a:5522'
        }
      ]
    }
  },
  'himehina': {
    'type': 'select',
    'info': {
      'id': 2,
      'stmpSlHd': '[sz:22][c:FFA6AA]HIMEHINAコラボ開催中!',
      'stmpSlFt': '[sz:23]期間 2022/04/07～2022/05/08',
      'stmpHd': '[sz:22][c:DAC491]SPECIAL STAMP BONUS',
      'stmpFt': '[sz:22]YOU CAN GET A STAMP AND BONUS! :)[br:5]TERM: 4/7～5/8',
      'stmpBg': 'bg_stamp_himehina',
      'sheet': '11#sheet_crew_1#c#ネメシスクルー田中ヒメ,12#sheet_crew_2#c#ネメシスクルー鈴木ヒナ',
      'data': [
        {
          'stmpid': 11,
          'stps': 15,
          'stprwrd': '1:b:100 2:b:100 3:b:100 4:b:100 5:b:1000 6:b:200 7:b:200 8:b:200 9:b:200 10:b:2000 11:b:500 12:b:500 13:b:500 14:b:500 15:c:122',
        },
        {
          'stmpid': 12,
          'stps': 15,
          'stprwrd': '1:b:100 2:b:100 3:b:100 4:b:100 5:b:1000 6:b:200 7:b:200 8:b:200 9:b:200 10:b:2000 11:b:500 12:b:500 13:b:500 14:b:500 15:c:123',
        }
      ]
    }
  },
  '11thanniv': {
    'type': 'main',
    'info': {
      'id': 0,
      'stmpHd': '[sz:22]SPECIAL STAMP BONUS',
      'stmpFt': '[sz:22]YOU CAN GET A STAMP AND BONUS! :)[br:5]TERM: 1/1～1/9',
      'data': [
        {
          'stmpid': 13,
          'stps': 1,
          'stprwrd': '1:a:5523'
        }
      ]
    }
  },
  'bpl2022stamp': {
    'type': 'select',
    'info': {
      'id': 3,
      'textstampval': -1,
      'stmpSlHd': '[sz:22][c:FFA6AA]BEMANI PRO LEAGUE -SEASON 2- SPECIAL STAMP',
      'stmpSlFt': '[sz:23]{TextStamp}[br:5]{TextTerm} 2023/03/30～2023/05/07',
      'stmpHd': '[sz:22][c:DAC491]BEMANI PRO LEAGUE -SEASON 2- SPECIAL STAMP',
      'stmpFt': '[sz:22]YOU CAN GET STAMPS BY PLAYING SDVX!',
      'stmpBg': 'bg_stamp_bpl',
      'sheet': '14#sheet_track_1919#e#1919,15#sheet_track_1920#e#1920,16#sheet_track_1921#e#1921,17#sheet_track_1922#e#1922,18#sheet_track_1923#e#1923,19#sheet_track_1924#e#1924,20#sheet_track_1925#e#1925,21#sheet_track_1926#e#1926,22#sheet_track_1938#e#1938',
      'data': [
        {
          'stmpid': 14,
          'stps': 15,
          'stprwrd': '15:e:191923'
        },
        {
          'stmpid': 15,
          'stps': 15,
          'stprwrd': '15:e:192023'
        },
        {
          'stmpid': 16,
          'stps': 15,
          'stprwrd': '15:e:192123'
        },
        {
          'stmpid': 17,
          'stps': 15,
          'stprwrd': '15:e:192223'
        },
        {
          'stmpid': 18,
          'stps': 15,
          'stprwrd': '15:e:192323'
        },
        {
          'stmpid': 19,
          'stps': 15,
          'stprwrd': '15:e:192423'
        },
        {
          'stmpid': 20,
          'stps': 15,
          'stprwrd': '15:e:192523'
        },
        {
          'stmpid': 21,
          'stps': 15,
          'stprwrd': '15:e:192623'
        },
        {
          'stmpid': 22,
          'stps': 30,
          'stprwrd': '0:r:x14 0:r:x15 0:r:x16 0:r:x17 0:r:x18 0:r:x19 0:r:x20 0:r:x21 30:e:193823'
        }
      ]
    }
  },
  'kac2023stamp': {
    'type': 'main',
    'info': {
      'id': 0,
      'stmpHd': '[sz:22][c:DAC491]SPECIAL STAMP BONUS',
      'stmpFt': '[sz:22]YOU CAN GET A STAMP AND BONUS! :)[br:5]TERM: 8/9～9/11',
      'data': [
        {
          'stmpid': 23,
          'stps': 10,
          'stprwrd': '10:e:206023'
        }
      ]
    }
  },
  'kac2023stamp2': {
    'type': 'select',
    'info': {
      'id': 4,
      'stmpSlHd': '[sz:22][c:DAC491]SPECIAL STAMP BONUS',
      'stmpSlFt': '[sz:23]期間 2023/09/20～2023/10/23',
      'stmpHd': '[sz:22][c:DAC491]SPECIAL STAMP BONUS',
      'stmpFt': '[sz:22]YOU CAN GET A STAMP AND BONUS! :)[br:5]TERM: 9/20～10/23',
      'stmpBg': 'bg_stamp_kac_11th',
      'sheet': '24#sheet_track_2061#e#2061,25#sheet_track_2062#e#2062',
      'data': [
        {
          'stmpid': 24,
          'stps': 10,
          'stprwrd': '10:e:206123'
        },
        {
          'stmpid': 25,
          'stps': 10,
          'stprwrd': '10:e:206223'
        }
      ]
    }
  },
  '2024stamp': {
    'type': 'main',
    'info': {
      'id': 0,
      'stmpHd': '[sz:22][c:DAC491]SPECIAL STAMP BONUS',
      'stmpFt': '[sz:22]YOU CAN GET A STAMP AND BONUS! :)[br:5]TERM: 1/1～1/8',
      'data': [
        {
          'stmpid': 26,
          'stps': 10,
          'stprwrd': '1:a:5526 2:b:2024 3:b:2024 4:b:2024 5:b:2024 6:b:2024 7:b:2024 8:b:2024 9:b:2024 10:b:4649'
        }
      ]
    }
  },
  '12thanniv': {
    'type': 'main',
    'info': {
      'id': 0,
      'stmpHd': '[sz:22][c:DAC491]SPECIAL STAMP BONUS',
      'stmpFt': '[sz:22]YOU CAN GET A STAMP AND BONUS! :)[br:5]TERM: 1/18～2/4',
      'data': [
        {
          'stmpid': 27,
          'stps': 1,
          'stprwrd': '1:a:5527'
        }
      ]
    }
  },
  '12thannivpcbevent': {
    'type': 'main',
    'info': {
      'id': 0,
      'stmpHd': '[sz:22][c:DAC491]SPECIAL STAMP BONUS',
      'stmpFt': '[sz:22]YOU CAN GET A STAMP AND BONUS! :)[br:5]TERM: 1/1～1/8',
      'data': [
        {
          'stmpid': 28,
          'stps': 10,
          'stprwrd': '1:b:329 2:b:329 3:b:329 4:b:329 5:b:1009 6:b:329 7:b:329 8:b:329 9:b:329 10:b:1009'
        }
      ]
    }
  },
  'bpls3sdvxfinal': {
    'type': 'comp',
    'info': {
      'id': 1,
      'data': {
        "id": 1,
        "compo": "stamp_complete_bpls3",
        "requires": [
            { "id": 2129, "grades": [0] }, { "id": 2130, "grades": [0] }, { "id": 2131, "grades": [0] },
            { "id": 2132, "grades": [0] }, { "id": 2133, "grades": [0] }, { "id": 2134, "grades": [0] },
            { "id": 2135, "grades": [0] }, { "id": 2136, "grades": [0] }, { "id": 2137, "grades": [0] },
            { "id": 2138, "grades": [0] }, { "id": 2139, "grades": [0] }, { "id": 2140, "grades": [0] },
            { "id": 2141, "grades": [0] }, { "id": 2142, "grades": [0] }, { "id": 2143, "grades": [0] },
            { "id": 2144, "grades": [0] }, { "id": 2145, "grades": [0] }, { "id": 2146, "grades": [0] },
            { "id": 2147, "grades": [0] }, { "id": 2148, "grades": [0] }, { "id": 2149, "grades": [0] },
            { "id": 2151, "grades": [0] }, { "id": 2150, "grades": [0] }, { "id": 2152, "grades": [0] }
        ],
        "rewards":[
            { "id": 2151, "grades": [0, 1, 2, 4], "needStamp": 7 },
            { "id": 2150, "grades": [0, 1, 2, 4], "needStamp": 14 },
            { "id": 2152, "grades": [0, 1, 2, 4], "needStamp": 23 }
        ]
      }
    }
  },
  'bpls3stamp': {
    'type': 'select',
    'info': {
      'id': 5,
      'textstampval': -1,
      'stmpSlHd': '[sz:22][c:FFA6AA]BEMANI PRO LEAGUE -SEASON 3- SPECIAL STAMP',
      'stmpSlFt': '[sz:23]{TextStamp}[br:5]{TextTerm} 2024/05/02～2024/05/31',
      'stmpHd': '[sz:22][c:DAC491]BEMANI PRO LEAGUE -SEASON 3- SPECIAL STAMP',
      'stmpFt': '[sz:22]YOU CAN GET STAMPS BY PLAYING SDVX!',
      'stmpBg': 'bg_stamp_bpls3',
      'sheet': '29#sheet_track_2121#e#2121,30#sheet_track_2122#e#2122,31#sheet_track_2123#e#2123,32#sheet_track_2124#e#2124,33#sheet_track_2125#e#2125,34#sheet_track_2126#e#2126,35#sheet_track_2127#e#2127,36#sheet_track_2128#e#2128,37#sheet_track_2160#e#2160,38#sheet_track_2161#e#2161',
      'data': [
        {
          'stmpid': 29,
          'stps': 15,
          'stprwrd': '15:e:212123'
        },
        {
          'stmpid': 30,
          'stps': 15,
          'stprwrd': '15:e:212223'
        },
        {
          'stmpid': 31,
          'stps': 15,
          'stprwrd': '15:e:212323'
        },
        {
          'stmpid': 32,
          'stps': 15,
          'stprwrd': '15:e:212423'
        },
        {
          'stmpid': 33,
          'stps': 15,
          'stprwrd': '15:e:212523'
        },
        {
          'stmpid': 34,
          'stps': 15,
          'stprwrd': '15:e:212623'
        },
        {
          'stmpid': 35,
          'stps': 15,
          'stprwrd': '15:e:212723'
        },
        {
          'stmpid': 36,
          'stps': 15,
          'stprwrd': '15:e:212823'
        },
        {
          'stmpid': 37,
          'stps': 15,
          'stprwrd': '15:e:216023'
        },
        {
          'stmpid': 38,
          'stps': 30,
          'stprwrd': '0:r:x29 0:r:x30 0:r:x31 0:r:x32 0:r:x33 0:r:x34 0:r:x35 0:r:x36 0:r:x37 30:e:216123'
        }
      ]
    }
  },
  'tamaadv': {
    'type': 'tama',
    'info': {
      'id': 39,
      'list': '0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40'
    }
  },
  'reflecstamp2': {
    'type': 'main',
    'info': {
      'id': 0,
      'stmpHd': '[sz:22][c:DAC491]SPECIAL STAMP BONUS',
      'stmpFt': '[sz:22]YOU CAN GET A STAMP AND BONUS! :)[br:5]TERM: 8/1～9/23',
      'data': [
        {
          'stmpid': 40,
          'stps': 15,
          'stprwrd': '1:e:205323 3:e:205723 6:e:205623 10:e:205523 15:e:205423'
        }
      ]
    }
  },
  'puc2024': {
    'type': 'select',
    'info': {
      'id': 6,
      'textstampval': -1,
      'stmpSlHd': '[sz:22][c:FFA6AA]PRECIOUS UNIVERSAL CELEBRATE STAMP',
      'stmpSlFt': '[sz:23]{TextTerm} 2024/12/12～2025/02/02',
      'stmpHd': '[sz:22][c:DAC491]PRECIOUS UNIVERSAL CELEBRATE STAMP',
      'stmpFt': '[sz:22]YOU CAN A STAMP AND BONUS! :)[br:5]TERM: 12/12～2/2',
      'stmpBg': 'bg_stamp_puct',
      'sheet': '41#sheet_track_1969#e#1969,42#sheet_track_1970#e#1970,43#sheet_track_1971#e#1971,44#sheet_track_1972#e#1972,45#sheet_track_1973#e#1973,46#sheet_track_1974#e#1974,47#sheet_track_1975#e#1975,48#sheet_track_1976#e#1976,49#sheet_track_1977#e#1977',
      'data': [
        {
          'stmpid': 41,
          'stps': 15,
          'stprwrd': '15:e:196923'
        },
        {
          'stmpid': 42,
          'stps': 25,
          'stprwrd': '25:e:197023'
        },
        {
          'stmpid': 43,
          'stps': 15,
          'stprwrd': '15:e:197123'
        },
        {
          'stmpid': 44,
          'stps': 25,
          'stprwrd': '25:e:197223'
        },
        {
          'stmpid': 45,
          'stps': 25,
          'stprwrd': '25:e:197323'
        },
        {
          'stmpid': 46,
          'stps': 25,
          'stprwrd': '25:e:197423'
        },
        {
          'stmpid': 47,
          'stps': 15,
          'stprwrd': '15:e:197523'
        },
        {
          'stmpid': 48,
          'stps': 15,
          'stprwrd': '15:e:197623'
        },
        {
          'stmpid': 49,
          'stps': 15,
          'stprwrd': '15:e:197723'
        }
      ]
    }
  },
  '2025stamp': {
    'type': 'main',
    'info': {
      'id': 0,
      'stmpHd': '[sz:22][c:DAC491]SPECIAL STAMP BONUS',
      'stmpFt': '[sz:22]YOU CAN GET A STAMP AND BONUS! :)[br:5]TERM: 1/1～1/8',
      'data': [
        {
          'stmpid': 50,
          'stps': 10,
          'stprwrd': '1:a:5539 2:b:2025 3:b:2025 4:b:2025 5:b:2025 6:b:2025 7:b:2025 8:b:2025 9:b:2025 10:b:4649'
        }
      ]
    }
  },
  '13thannivpcbevent': {
    'type': 'main',
    'info': {
      'id': 0,
      'stmpHd': '[sz:22][c:DAC491]SPECIAL STAMP BONUS',
      'stmpFt': '[sz:22]YOU CAN GET A STAMP AND BONUS! :)[br:5]TERM: 1/18～2/2',
      'data': [
        {
          'stmpid': 51,
          'stps': 10,
          'stprwrd': '1:b:390 2:b:390 3:b:390 4:b:390 5:b:1009 6:b:390 7:b:390 8:b:390 9:b:390 10:b:1009'
        }
      ]
    }
  },
  'hololiveexpo': {
    'type': 'main',
    'info': {
      'id': 0,
      'stmpHd': '[sz:22]SPECIAL STAMP BONUS',
      'stmpFt': '[sz:22]YOU CAN GET A STAMP AND BONUS! :)[br:5]TERM: 2/20～3/23',
      'data': [
        {
          'stmpid': 52,
          'stps': 10,
          'stprwrd': '1:a:5541 3:n:40245 6:n:40246 10:n:40247 req:musicid:2069,2070,2071,2072,2073 imgbg:bg_stamp_fubuki'
        },
        {
          'stmpid': 53,
          'stps': 10,
          'stprwrd': '1:a:5542 3:n:40248 6:n:40249 10:n:40250 req:musicid:2165,2166,2167 imgbg:bg_stamp_okayu'
        },
        {
          'stmpid': 54,
          'stps': 10,
          'stprwrd': '1:a:5543 3:n:40251 6:n:40252 10:n:40253 req:musicid:2172,2173,2174,2175 imgbg:bg_stamp_watame'
        },
        {
          'stmpid': 55,
          'stps': 10,
          'stprwrd': '1:a:5544 3:n:40254 6:n:40255 10:n:40256 req:musicid:1753,1754,1755,1756,1757,1758,2071,2194,2195,2196,2197 imgbg:bg_stamp_marine'
        },
        {
          'stmpid': 56,
          'stps': 10,
          'stprwrd': '1:a:5545 3:n:40257 6:n:40258 10:n:40259 req:musicid:1755,2205,2206,2207,2208 imgbg:bg_stamp_pekora'
        }
      ]
    }
  },
  'vgate1': {
    'info': {
      'id': 57,
      'setid': 1
    }
  },
  'vgate2': {
    'info': {
      'id': 59,
      'setid': 2
    }
  },
  'reflecstamp3': {
    'type': 'main',
    'info': {
      'id': 0,
      'stmpHd': '[sz:22][c:DAC491]SPECIAL STAMP BONUS',
      'stmpFt': '[sz:22]YOU CAN GET A STAMP AND BONUS! :)[br:5]TERM: 5/29～7/6',
      'data': [
        {
          'stmpid': 58,
          'stps': 15,
          'stprwrd': '1:e:223523 3:e:223623 6:e:223823 10:e:223723 15:e:223923' 
        }
      ]
    }
  },
  'gitadorastamp': {
    'type': 'main',
    'info': {
      'id': 0,
      'stmpHd': '[sz:22][c:DAC491]SPECIAL STAMP BONUS',
      'stmpFt': '[sz:22]YOU CAN GET A STAMP AND BONUS! :)[br:5]TERM: 12/11～1/12',
      'data': [
        {
          'stmpid': 60,
          'stps': 10,
          'stprwrd': '1:e:234223 10:e:233823' 
        }
      ]
    }
  }
}

export const EVENT_ITEMS6 = {
  // X-Record songs
  'xrecord_1_1': ['1737'],
  'xrecord_1_2': ['1738'],
  'xrecord_1_3': ['1736'],
  'xrecord_2_1': ['1848'],
  'xrecord_2_2': ['1849'],
  'xrecord_2_3': ['1847'],
  'xrecord_3_1': ['1979'],
  'xrecord_3_2': ['1980'],
  'xrecord_3_3': ['1978'],
  // Konaste songs
  'konasute_1': ['1762'],
  'konasute_2': ['1763'],
  'konasute_3': ['1764'],
  'konasute_4': ['1765'],
  'konasute_5': ['1811'],
  // BPL2021 songs
  'bpl2021_1': ['1808'],
  'bpl2021_2': ['1809'],
  // BSB2021 songs
  'bsb2021_1': ['1802'],
  'bsb2021_2': ['1803'],
  'bsb2021_3': ['1804'],
  'bsb2021_4': ['1805'],
  'bsb2021_5': ['1806'],
  'bsb2021_6': ['1807'],
  // SDVX 10th anniversary stamp event songs
  'sdvx10thstamp': ['1838', '1839', '1840', '1841', '1842', '1843', '1844'],
  // REFLECT BEAT stamp event songs
  'reflecstamp': ['1850', '1851', '1852', '1853', '1854'],
  // BEMANI ichika 2022 event songs
  'gmz2022_1': ['1906'],
  'gmz2022_2': ['1907'],
  'gmz2022_3': ['1908'],
  'gmz2022_4': ['1909'],
  'gmz2022_5': ['1910'],
  // BPL2022 songs
  "bpl2022_1": ['1952', '1943'],
  "bpl2022_2": ['1948', '1951'],
  "bpl2022_3": ['1956', '1949'],
  "bpl2022_4": ['1946', '1958'],
  "bpl2022_5": ['1957', '1955'],
  "bpl2022_6": ['1947', '1953'],
  "bpl2022_7": ['1950', '1944'],
  "bpl2022_8": ['1945', '1954'],
  "bpl2022_9": ['1942'],
  "bpl2022_10": ['1939'],
  "bpl2022_11": ['1940'],
  "bpl2022_12": ['1941'],
  // KAC2023
  "kac2023perfecteater": ['2059'],
  "kac2023stamp": ['2060'],
  "kac2023stamp2": ['2061', '2062'],
  // BPL S3 Triple Tribe
  "bpls3songs_1": ['2063'],
  "bpls3songs_2": ['2064'],
  "bpls3songs_3": ['2065'],
  // CHASECHASEJOKERS song
  "ccjsong": ['2027'],
  // BPL S3 SDVX songs
  "bpls3sdvx_1": ['2129', '2130'],
  "bpls3sdvx_2": ['2132', '2133', '2134'],
  "bpls3sdvx_3": ['2135', '2136', '2137'],
  "bpls3sdvx_4": ['2138', '2139', '2140'],
  "bpls3sdvx_5": ['2141', '2142', '2143'],
  "bpls3sdvx_6": ['2144', '2145', '2146'],
  "bpls3sdvx_7": ['2131', '2147', '2148', '2149'],
  // BPL S3 Triple Tribe 2
  "bpls3tripletribe2_1": ['2162'],
  "bpls3tripletribe2_2": ['2163'],
  "bpls3tripletribe2_3": ['2164'],
  // Mini Grace crew gift
  "minigracegift": ['159'],
  // MYSTICAL Re:UNION
  "mystreun_1": ['2179'],
  "mystreun_2": ['2178'],
  "mystreun_3": ['2177'],
  "mystreun_4": ['2180'],
  "mystreun_5": ['2181'],
  "bpls4tripletribe_1": ['2189'],
  "bpls4tripletribe_2": ['2190'],
  "bpls4tripletribe_3": ['2191'],
  // 13th anniversary appeal stamp
  "13thannivap": ['5540'],
  "crossresonance_1": ['2231'],
  "crossresonance_2": ['2232'],
  "crossresonance_3": ['2233'],
  "crossresonance_4": ['2260'],
  "crossresonance_5": ['2261'],
  "crossresonance_6": ['2262'],
  "crossresonance_7": ['2284'],
  "crossresonance_8": ['2285'],
  "crossresonance_9": ['2286'],
  "crossresonance_10": ['2339'],
  "crossresonance_11": ['2340'],
  "crossresonance_12": ['2341'],
  "bpls5tripletribe_1": ['2247'],
  "bpls5tripletribe_2": ['2249'],
  "bpls5tripletribe_3": ['2246'],
  "bpls5tripletribe_4": ['2263'],
  "bpls5tripletribe_5": ['2250'],
  "bpls5sdvx_1": ['2314'],
  "bpls5sdvx_2": ['2315'],
  "bpls5sdvx_3": ['2316'],
  "bpls5sdvx_4": ['2317'],
  "bpls5apica_1": ['5547'],
  "bpls5apica_2": ['5548'],
  "bpls5apica_3": ['5549'],
  "bpls5apica_4": ['5550'],
  "bpls5apica_5": ['5551'],
  "bpls5apica_6": ['5552'],
  "bpls5apica_7": ['5553']
}


// rule: 0 score 1 point 2 vote
// rank_match_target: 0 arena 1 single 2 mega
export const CURRENT_ARENA = {
  season: 22,
  rule: 2,
  rank_match_target: 0,
  time_start: BigInt(Date.parse('19 Dec 2025 08:00:00 GMT')),
  time_end: BigInt(Date.parse('23 Dec 2025 15:59:59 GMT')),
  shop_start: BigInt(Date.parse('19 Dec 2025 08:00:00 GMT')),
  shop_end: BigInt(Date.parse('23 Dec 2025 15:59:59 GMT'))
}

// catalog_id, catalog_type, price, item_type, item_id, param 

export const ARENA_STATION_ITEMS = {
  'None': {},
  'Set 1': {
    items: [
      [1, 1, 15000, 11, 101, 1],
      [1, 1, 15000, 11, 95, 1],
      [1, 1, 8000, 0, 1855, 23],
      [1, 1, 8000, 0, 381, 8],
      [1, 1, 8000, 0, 633, 8],
      [1, 1, 4000, 0, 332, 8],
      [1, 1, 4000, 0, 711, 8],
      [1, 1, 4000, 0, 871, 8],
      [1, 1, 2000, 0, 872, 8],
      [1, 1, 2000, 0, 64, 8],
      [1, 1, 2000, 0, 88, 8]
    ],
    version: 20220425
  },
  'Set 2': {
    items: [
      [1, 1, 15000, 11, 103, 1],
      [1, 1, 8000, 0, 1742, 23],
      [1, 1, 8000, 0, 632, 8],
      [1, 1, 4000, 0, 37, 8],
      [1, 1, 4000, 0, 239, 8],
      [1, 1, 2000, 0, 111, 8],
      [1, 1, 2000, 0, 132, 8]
    ],
    version: 20220628
  },
  'Set 3': {
    items: [
      [1, 1, 15000, 11, 104, 1],
      [1, 1, 8000, 0, 1743, 23],
      [1, 1, 8000, 0, 342, 8],
      [1, 1, 4000, 0, 131, 8],
      [1, 1, 4000, 0, 612, 8],
      [1, 1, 2000, 0, 8, 8],
      [1, 1, 2000, 0, 323, 8]
    ],
    version: 20220830
  },
  'Set 4': {
    items: [
      [1, 1, 15000, 11, 122, 1],
      [1, 1, 15000, 11, 123, 1],
      [1, 1, 15000, 0, 1902, 23],
      [1, 1, 8000, 0, 1855, 23],
      [1, 1, 8000, 0, 381, 8],
      [1, 1, 8000, 0, 633, 8],
      [1, 1, 4000, 0, 332, 8],
      [1, 1, 4000, 0, 711, 8],
      [1, 1, 4000, 0, 871, 8],
      [1, 1, 2000, 0, 872, 8],
      [1, 1, 2000, 0, 64, 8],
      [1, 1, 2000, 0, 88, 8]
    ],
    version: 20221018
  },
  'Set 5': {
    items: [
      [1, 1, 15000, 11, 112, 1],
      [1, 1, 8000, 0, 1745, 23],
      [1, 1, 8000, 0, 1742, 23],
      [1, 1, 8000, 0, 632, 8],
      [1, 1, 4000, 0, 37, 8],
      [1, 1, 4000, 0, 239, 8],
      [1, 1, 2000, 0, 111, 8],
      [1, 1, 2000, 0, 132, 8]
    ],
    version: 20221220
  },
  'Set 6': {
    items: [
      [1, 1, 8000, 0, 1846, 23],
      [1, 1, 8000, 0, 1743, 23],
      [1, 1, 8000, 0, 342, 8],
      [1, 1, 4000, 0, 131, 8],
      [1, 1, 4000, 0, 612, 8],
      [1, 1, 2000, 0, 8, 8],
      [1, 1, 2000, 0, 323, 8]
    ],
    version: 20230214
  },
  'Set 7': {
    items: [
      [1, 1, 15000, 11, 122, 1],
      [1, 1, 15000, 11, 123, 1],
      [1, 1, 4000, 0, 786, 8],
      [1, 1, 4000, 0, 787, 8],
      [1, 1, 4000, 0, 788, 8],
      [1, 1, 8000, 0, 789, 8],
      [1, 1, 8000, 0, 790, 8],
      [1, 1, 8000, 0, 610, 8],
      [1, 1, 8000, 0, 1902, 23],
      [1, 1, 8000, 0, 381, 8],
      [1, 1, 8000, 0, 633, 8],
      [1, 1, 4000, 0, 332, 8],
      [1, 1, 4000, 0, 711, 8],
      [1, 1, 4000, 0, 871, 8],
      [1, 1, 2000, 0, 872, 8],
      [1, 1, 2000, 0, 64, 8],
      [1, 1, 2000, 0, 88, 8]
    ],
    version: 20230425
  },
  'Set 8': {
    items: [
      [1, 1, 15000, 11, 112, 1],
      [1, 1, 8000, 0, 510, 8],
      [1, 1, 8000, 0, 842, 8],
      [1, 1, 8000, 0, 281, 8],
      [1, 1, 4000, 0, 1745, 23],
      [1, 1, 4000, 0, 1742, 23],
      [1, 1, 8000, 0, 632, 8],
      [1, 1, 4000, 0, 37, 8],
      [1, 1, 4000, 0, 239, 8],
      [1, 1, 2000, 0, 111, 8],
      [1, 1, 2000, 0, 132, 8]
    ],
    version: 20230607
  },
  'Set 9': {
    items: [
      [1, 1, 8000, 0, 634, 8],
      [1, 1, 8000, 0, 348, 8],
      [1, 1, 8000, 0, 165, 8],
      [1, 1, 4000, 0, 1743, 23],
      [1, 1, 4000, 0, 1846, 23],
      [1, 1, 8000, 0, 342, 8],
      [1, 1, 4000, 0, 131, 8],
      [1, 1, 4000, 0, 612, 8],
      [1, 1, 2000, 0, 8, 8],
      [1, 1, 2000, 0, 323, 8]
    ],
    version: 20230704
  },
  'Set 10': {
    items: [
      [1, 1, 15000, 11, 102, 1],
      [1, 1, 8000, 0, 786, 8],
      [1, 1, 8000, 0, 787, 8],
      [1, 1, 8000, 0, 788, 8],
      [1, 1, 4000, 0, 789, 8],
      [1, 1, 4000, 0, 790, 8],
      [1, 1, 8000, 0, 610, 8],
      [1, 1, 8000, 0, 1902, 23],
      [1, 1, 8000, 0, 1855, 23],
      [1, 1, 8000, 0, 381, 8],
      [1, 1, 8000, 0, 633, 8],
      [1, 1, 4000, 0, 332, 8],
      [1, 1, 4000, 0, 711, 8],
      [1, 1, 4000, 0, 871, 8],
      [1, 1, 2000, 0, 872, 8],
      [1, 1, 2000, 0, 64, 8],
      [1, 1, 2000, 0, 88, 8]
    ],
    version: 20230807
  },
  'Set 11': {
    items: [
      [1, 1, 15000, 11, 104, 1],
      [1, 1, 8000, 0, 1742, 23],
      [1, 1, 8000, 0, 1745, 23],
      [1, 1, 8000, 0, 289, 8],
      [1, 1, 4000, 0, 241, 8],
      [1, 1, 4000, 0, 390, 8],
      [1, 1, 8000, 0, 510, 8],
      [1, 1, 8000, 0, 842, 8],
      [1, 1, 8000, 0, 281, 8],
      [1, 1, 8000, 0, 632, 8],
      [1, 1, 4000, 0, 37, 8],
      [1, 1, 4000, 0, 239, 8],
      [1, 1, 2000, 0, 111, 8],
      [1, 1, 2000, 0, 132, 8]
    ],
    version: 20231024
  },
  'Set 12': {
    items: [
      [1, 1, 5000, 11, 29, 1],
      [1, 1, 5000, 11, 83, 1],
      [1, 1, 5000, 0, 2077, 23],
      [1, 1, 5000, 0, 2078, 23],
      [1, 1, 8000, 0, 634, 8],
      [1, 1, 8000, 0, 348, 8],
      [1, 1, 8000, 0, 165, 8],
      [1, 1, 8000, 0, 342, 8],
      [1, 1, 4000, 0, 131, 8],
      [1, 1, 4000, 0, 612, 8],
      [1, 1, 2000, 0, 8, 8],
      [1, 1, 2000, 0, 323, 8]
    ],
    version: 20231219
  },
  'Set 13': {
    items: [
      [1, 1, 2000, 0, 85, 8],
      [1, 1, 4000, 0, 389, 8],
      [1, 1, 8000, 0, 635, 8],
      [1, 1, 8000, 0, 2171, 23],
      [1, 1, 4000, 0, 786, 8],
      [1, 1, 4000, 0, 787, 8],
      [1, 1, 4000, 0, 788, 8],
      [1, 1, 8000, 0, 789, 8],
      [1, 1, 8000, 0, 790, 8],
      [1, 1, 8000, 0, 610, 8],
      [1, 1, 5000, 0, 2077, 23],
      [1, 1, 5000, 0, 2078, 23],
      [1, 1, 15000, 0, 1902, 23],
      [1, 1, 8000, 0, 1855, 23],
      [1, 1, 8000, 0, 381, 8],
      [1, 1, 8000, 0, 633, 8],
      [1, 1, 4000, 0, 332, 8],
      [1, 1, 4000, 0, 711, 8],
      [1, 1, 4000, 0, 871, 8],
      [1, 1, 2000, 0, 872, 8],
      [1, 1, 2000, 0, 64, 8],
      [1, 1, 2000, 0, 88, 8]
    ],
    version: 20240430
  },
  'Set 14': {
    items: [
      [1, 1, 2000, 0, 85, 8],
      [1, 1, 4000, 0, 389, 8],
      [1, 1, 8000, 0, 635, 8],
      [1, 1, 8000, 0, 2171, 23],
      [1, 1, 4000, 0, 786, 8],
      [1, 1, 4000, 0, 787, 8],
      [1, 1, 4000, 0, 788, 8],
      [1, 1, 8000, 0, 789, 8],
      [1, 1, 8000, 0, 790, 8],
      [1, 1, 8000, 0, 610, 8],
      [1, 1, 5000, 0, 2077, 23],
      [1, 1, 5000, 0, 2078, 23],
      [1, 1, 15000, 0, 1902, 23],
      [1, 1, 8000, 0, 1855, 23],
      [1, 1, 8000, 0, 381, 8],
      [1, 1, 8000, 0, 633, 8],
      [1, 1, 4000, 0, 332, 8],
      [1, 1, 4000, 0, 711, 8],
      [1, 1, 4000, 0, 871, 8],
      [1, 1, 2000, 0, 872, 8],
      [1, 1, 2000, 0, 64, 8],
      [1, 1, 2000, 0, 88, 8]
    ],
    version: 20240709
  },
  'Set 15': {
    items: [
      [1, 1, 5000, 0, 2077, 23],
      [1, 1, 5000, 0, 2078, 23],
      [1, 1, 8000, 0, 634, 8],
      [1, 1, 8000, 0, 348, 8],
      [1, 1, 8000, 0, 165, 8],
      [1, 1, 4000, 0, 1743, 23],
      [1, 1, 4000, 0, 1846, 23],
      [1, 1, 8000, 0, 342, 8],
      [1, 1, 4000, 0, 131, 8],
      [1, 1, 4000, 0, 612, 8],
      [1, 1, 2000, 0, 8, 8],
      [1, 1, 2000, 0, 323, 8]
    ],
    version: 20240827
  },
  'Set 16': {
    items: [
      [1, 1, 5000, 11, 82, 1],
      [1, 1, 15000, 11, 95, 1],
      [1, 1, 15000, 11, 101, 1],
      [1, 1, 15000, 11, 103, 1],
      [1, 1, 15000, 11, 104, 1],
      [1, 1, 15000, 11, 112, 1],
      [1, 1, 4000, 0, 1855, 23],
      [1, 1, 4000, 0, 1742, 23],
      [1, 1, 4000, 0, 1743, 23],
      [1, 1, 15000, 0, 1902, 23],
      [1, 1, 5000, 0, 2077, 23],
      [1, 1, 5000, 0, 2078, 23],
      [1, 1, 8000, 0, 2171, 23],
      [1, 1, 4000, 0, 381, 8],
      [1, 1, 4000, 0, 633, 8],
      [1, 1, 4000, 0, 632, 8],
      [1, 1, 4000, 0, 342, 8],
      [1, 1, 8000, 0, 789, 8],
      [1, 1, 8000, 0, 790, 8],
      [1, 1, 8000, 0, 610, 8],
      [1, 1, 8000, 0, 635, 8],
      [1, 1, 2000, 0, 332, 8],
      [1, 1, 2000, 0, 711, 8],
      [1, 1, 2000, 0, 871, 8],
      [1, 1, 2000, 0, 37, 8],
      [1, 1, 2000, 0, 239, 8],
      [1, 1, 2000, 0, 131, 8],
      [1, 1, 2000, 0, 612, 8],
      [1, 1, 4000, 0, 786, 8],
      [1, 1, 4000, 0, 787, 8],
      [1, 1, 4000, 0, 788, 8],
      [1, 1, 4000, 0, 389, 8],
      [1, 1, 1000, 0, 872, 8],
      [1, 1, 1000, 0, 64, 8],
      [1, 1, 1000, 0, 88, 8],
      [1, 1, 1000, 0, 111, 8],
      [1, 1, 1000, 0, 132, 8],
      [1, 1, 1000, 0, 8, 8],
      [1, 1, 1000, 0, 323, 8],
      [1, 1, 2000, 0, 85, 8]
    ],
    version: 20241022
  },
  'Set 17': {
    items: [
      [1, 1, 5000, 11, 29, 1],
      [1, 1, 5000, 11, 83, 1],
      [1, 1, 8000, 0, 1762, 23],
      [1, 1, 8000, 0, 1763, 23],
      [1, 1, 8000, 0, 1764, 23],
      [1, 1, 8000, 0, 1765, 23],
      [1, 1, 15000, 0, 1811, 23],
      [1, 1, 4000, 0, 1855, 23],
      [1, 1, 4000, 0, 1742, 23],
      [1, 1, 4000, 0, 1743, 23],
      [1, 1, 8000, 0, 1745, 23],
      [1, 1, 5000, 0, 2077, 23],
      [1, 1, 5000, 0, 2078, 23],
      [1, 1, 4000, 0, 381, 8],
      [1, 1, 4000, 0, 633, 8],
      [1, 1, 4000, 0, 632, 8],
      [1, 1, 4000, 0, 342, 8],
      [1, 1, 8000, 0, 289, 8],
      [1, 1, 2000, 0, 332, 8],
      [1, 1, 2000, 0, 711, 8],
      [1, 1, 2000, 0, 871, 8],
      [1, 1, 2000, 0, 37, 8],
      [1, 1, 2000, 0, 239, 8],
      [1, 1, 2000, 0, 131, 8],
      [1, 1, 2000, 0, 612, 8],
      [1, 1, 4000, 0, 510, 8],
      [1, 1, 4000, 0, 842, 8],
      [1, 1, 4000, 0, 241, 8],
      [1, 1, 4000, 0, 390, 8],
      [1, 1, 1000, 0, 872, 8],
      [1, 1, 1000, 0, 64, 8],
      [1, 1, 1000, 0, 88, 8],
      [1, 1, 1000, 0, 111, 8],
      [1, 1, 1000, 0, 132, 8],
      [1, 1, 1000, 0, 8, 8],
      [1, 1, 1000, 0, 323, 8],
      [1, 1, 2000, 0, 281, 8]
    ],
    version: 20241223
  },
  'Set 18': {
    items: [
      [1, 1, 4000, 0, 1855, 23],
      [1, 1, 4000, 0, 1742, 23],
      [1, 1, 4000, 0, 1743, 23],
      [1, 1, 4000, 0, 1745, 23],
      [1, 1, 4000, 0, 1846, 23],
      [1, 1, 15000, 0, 1902, 23],
      [1, 1, 5000, 0, 2077, 23],
      [1, 1, 5000, 0, 2078, 23],
      [1, 1, 4000, 0, 381, 8],
      [1, 1, 4000, 0, 633, 8],
      [1, 1, 4000, 0, 632, 8],
      [1, 1, 4000, 0, 342, 8],
      [1, 1, 8000, 0, 634, 8],
      [1, 1, 2000, 0, 332, 8],
      [1, 1, 2000, 0, 711, 8],
      [1, 1, 2000, 0, 871, 8],
      [1, 1, 2000, 0, 37, 8],
      [1, 1, 2000, 0, 239, 8],
      [1, 1, 2000, 0, 131, 8],
      [1, 1, 2000, 0, 612, 8],
      [1, 1, 4000, 0, 348, 8],
      [1, 1, 1000, 0, 872, 8],
      [1, 1, 1000, 0, 64, 8],
      [1, 1, 1000, 0, 88, 8],
      [1, 1, 1000, 0, 111, 8],
      [1, 1, 1000, 0, 132, 8],
      [1, 1, 1000, 0, 8, 8],
      [1, 1, 1000, 0, 323, 8],
      [1, 1, 2000, 0, 165, 8]
    ],
    version: 20250225
  },
  'Set 19': {
    items: [
      [1, 1, 8000, 0, 418, 8],
      [1, 1, 4000, 0, 779, 8],
      [1, 1, 2000, 0, 225, 8],
      [1, 1, 4000, 0, 1745, 23],
      [1, 1, 4000, 0, 1846, 23],
      [1, 1, 15000, 0, 1902, 23],
      [1, 1, 5000, 0, 2077, 23],
      [1, 1, 5000, 0, 2078, 23],
      [1, 1, 8000, 0, 2171, 23],
      [1, 1, 4000, 0, 381, 8],
      [1, 1, 4000, 0, 633, 8],
      [1, 1, 4000, 0, 632, 8],
      [1, 1, 4000, 0, 342, 8],
      [1, 1, 8000, 0, 789, 8],
      [1, 1, 8000, 0, 790, 8],
      [1, 1, 8000, 0, 610, 8],
      [1, 1, 8000, 0, 635, 8],
      [1, 1, 2000, 0, 332, 8],
      [1, 1, 2000, 0, 711, 8],
      [1, 1, 2000, 0, 871, 8],
      [1, 1, 2000, 0, 37, 8],
      [1, 1, 2000, 0, 239, 8],
      [1, 1, 2000, 0, 131, 8],
      [1, 1, 2000, 0, 612, 8],
      [1, 1, 4000, 0, 786, 8],
      [1, 1, 4000, 0, 787, 8],
      [1, 1, 4000, 0, 788, 8],
      [1, 1, 4000, 0, 389, 8],
      [1, 1, 1000, 0, 872, 8],
      [1, 1, 1000, 0, 64, 8],
      [1, 1, 1000, 0, 88, 8],
      [1, 1, 1000, 0, 111, 8],
      [1, 1, 1000, 0, 132, 8],
      [1, 1, 1000, 0, 8, 8],
      [1, 1, 1000, 0, 323, 8],
      [1, 1, 2000, 0, 85, 8],
    ],
    version: 20250513
  },
  'Set 20': {
    items: [
      [1, 1, 5000, 11, 8, 1],
      [1, 1, 5000, 11, 80, 1],
      [1, 1, 5000, 11, 52, 1],
      [1, 1, 5000, 11, 93, 1],
      [1, 1, 15000, 11, 102, 1],
      [1, 1, 4000, 0, 183, 8],
      [1, 1, 4000, 0, 466, 8],
      [1, 1, 2000, 0, 61, 8],
      [1, 1, 8000, 0, 1762, 23],
      [1, 1, 8000, 0, 1763, 23],
      [1, 1, 8000, 0, 1764, 23],
      [1, 1, 8000, 0, 1765, 23],
      [1, 1, 15000, 0, 1811, 23],
      [1, 1, 5000, 0, 2077, 23],
      [1, 1, 5000, 0, 2078, 23],
      [1, 1, 4000, 0, 789, 8],
      [1, 1, 4000, 0, 790, 8],
      [1, 1, 4000, 0, 634, 8],
      [1, 1, 8000, 0, 289, 8],
      [1, 1, 4000, 0, 610, 8],
      [1, 1, 2000, 0, 786, 8],
      [1, 1, 2000, 0, 787, 8],
      [1, 1, 2000, 0, 788, 8],
      [1, 1, 2000, 0, 510, 8],
      [1, 1, 2000, 0, 842, 8],
      [1, 1, 2000, 0, 348, 8],
      [1, 1, 4000, 0, 241, 8],
      [1, 1, 4000, 0, 390, 8],
      [1, 1, 1000, 0, 281, 8],
      [1, 1, 1000, 0, 165, 8]
    ],
    version: 20250805
  },
  'Set 21': {
    items: [
      [1, 1, 5000, 11, 82, 1],
      [1, 1, 15000, 11, 95, 1],
      [1, 1, 15000, 11, 101, 1],
      [1, 1, 15000, 11, 103, 1],
      [1, 1, 15000, 11, 104, 1],
      [1, 1, 15000, 11, 112, 1],
      [1, 1, 8000, 0, 836, 8],
      [1, 1, 4000, 0, 687, 8],
      [1, 1, 2000, 0, 475, 8],
      [1, 1, 8000, 0, 1762, 23],
      [1, 1, 8000, 0, 1763, 23],
      [1, 1, 8000, 0, 1764, 23],
      [1, 1, 8000, 0, 1765, 23],
      [1, 1, 15000, 0, 1811, 23],
      [1, 1, 5000, 0, 2077, 23],
      [1, 1, 5000, 0, 2078, 23],
      [1, 1, 8000, 0, 2171, 23],
      [1, 1, 4000, 0, 789, 8],
      [1, 1, 4000, 0, 790, 8],
      [1, 1, 4000, 0, 610, 8],
      [1, 1, 4000, 0, 634, 8],
      [1, 1, 8000, 0, 289, 8],
      [1, 1, 8000, 0, 635, 8],
      [1, 1, 8000, 0, 418, 8],
      [1, 1, 2000, 0, 786, 8],
      [1, 1, 2000, 0, 787, 8],
      [1, 1, 2000, 0, 788, 8],
      [1, 1, 2000, 0, 510, 8],
      [1, 1, 2000, 0, 842, 8],
      [1, 1, 2000, 0, 348, 8],
      [1, 1, 4000, 0, 241, 8],
      [1, 1, 4000, 0, 390, 8],
      [1, 1, 4000, 0, 389, 8],
      [1, 1, 4000, 0, 779, 8],
      [1, 1, 4000, 0, 183, 8],
      [1, 1, 4000, 0, 466, 8],
      [1, 1, 1000, 0, 281, 8],
      [1, 1, 1000, 0, 165, 8],
      [1, 1, 2000, 0, 85, 8],
      [1, 1, 2000, 0, 225, 8],
      [1, 1, 2000, 0, 61, 8],

    ],
    version: 20251021
  },
  'Set 22 (Final)': {
    items: [
      [1, 1, 1250, 11, 82, 1],
      [1, 1, 3750, 11, 95, 1],
      [1, 1, 3750, 11, 101, 1],
      [1, 1, 3750, 11, 103, 1],
      [1, 1, 3750, 11, 104, 1],
      [1, 1, 3750, 11, 112, 1],
      [1, 1, 2000, 0, 836, 8],
      [1, 1, 1000, 0, 687, 8],
      [1, 1, 500, 0, 475, 8],
      [1, 1, 1000, 0, 183, 8],
      [1, 1, 1000, 0, 466, 8],
      [1, 1, 500, 0, 61, 8],
      [1, 1, 2000, 0, 418, 8],
      [1, 1, 1000, 0, 779, 8],
      [1, 1, 500, 0, 225, 8],
      [1, 1, 2000, 0, 1762, 23],
      [1, 1, 2000, 0, 1763, 23],
      [1, 1, 2000, 0, 1764, 23],
      [1, 1, 2000, 0, 1765, 23],
      [1, 1, 3750, 0, 1811, 23],
      [1, 1, 2000, 0, 2171, 23],
      [1, 1, 2000, 0, 635, 8],
      [1, 1, 1000, 0, 389, 8],
      [1, 1, 500, 0, 85, 8],
      [1, 1, 1250, 0, 2077, 23],
      [1, 1, 1250, 0, 2078, 23],
      [1, 1, 2000, 0, 289, 8],
      [1, 1, 1000, 0, 241, 8],
      [1, 1, 1000, 0, 390, 8],
      [1, 1, 1000, 0, 634, 8],
      [1, 1, 500, 0, 348, 8],
      [1, 1, 250, 0, 165, 8],
      [1, 1, 500, 0, 510, 8],
      [1, 1, 500, 0, 842, 8],
      [1, 1, 250, 0, 281, 8],
      [1, 1, 500, 0, 786, 8],
      [1, 1, 500, 0, 787, 8],
      [1, 1, 500, 0, 788, 8],
      [1, 1, 1000, 0, 789, 8],
      [1, 1, 1000, 0, 790, 8],
      [1, 1, 1000, 0, 610, 8],
    ],
    version: 20251209
  }
};


export const VALGENE = {
  info: [
    {
      valgene_name: "ヴァルキリージェネレーター　第1弾",
      valgene_name_english: "Valkyrie Generator Vol. 1",
      valgene_id: 1,
      version: 20210426
    },
    {
      valgene_name: "ヴァルキリージェネレーター　第2弾",
      valgene_name_english: "Valkyrie Generator Vol. 2",
      valgene_id: 2,
      version: 20210629
    },
    {
      valgene_name: "ヴァルキリージェネレーター　第3弾",
      valgene_name_english: "Valkyrie Generator Vol. 3",
      valgene_id: 3,
      version: 20210824
    },
    {
      valgene_name: "ヴァルキリージェネレーター　第4弾",
      valgene_name_english: "Valkyrie Generator Vol. 4",
      valgene_id: 4,
      version: 20211020
    },
    {
      valgene_name: "ヴァルキリージェネレーター　第5弾",
      valgene_name_english: "Valkyrie Generator Vol. 5",
      valgene_id: 5,
      version: 20211214
    },
    {
      valgene_name: "ヴァルキリージェネレーター　第6弾",
      valgene_name_english: "Valkyrie Generator Vol. 6",
      valgene_id: 6,
      version: 20220308
    },
    {
      valgene_name: "ヴァルキリージェネレーター　第7弾",
      valgene_name_english: "Valkyrie Generator Vol. 7",
      valgene_id: 7,
      version: 20220607
    },
    {
      valgene_name: "ヴァルキリージェネレーター　第8弾",
      valgene_name_english: "Valkyrie Generator Vol. 8",
      valgene_id: 8,
      version: 20220816
    },
    {
      valgene_name: "ヴァルキリージェネレーター　第9弾",
      valgene_name_english: "Valkyrie Generator Vol. 9",
      valgene_id: 9,
      version: 20221018
    },
    {
      valgene_name: "ヴァルキリージェネレーター　第10弾",
      valgene_name_english: "Valkyrie Generator Vol. 10",
      valgene_id: 10,
      version: 20230228
    },
    {
      valgene_name: "ヴァルキリージェネレーター　第11弾",
      valgene_name_english: "Valkyrie Generator Vol. 11",
      valgene_id: 11,
      version: 20230425
    },
    {
      valgene_name: "ヴァルキリージェネレーター　第12弾",
      valgene_name_english: "Valkyrie Generator Vol. 12",
      valgene_id: 12,
      version: 20230807
    },
    {
      valgene_name: "ヴァルキリージェネレーター　第13弾",
      valgene_name_english: "Valkyrie Generator Vol. 13",
      valgene_id: 13,
      version: 20240116
    },
    {
      valgene_name: "ヴァルキリージェネレーター　第14弾",
      valgene_name_english: "Valkyrie Generator Vol. 14",
      valgene_id: 14,
      version: 20240430
    },
    {
      valgene_name: "ヴァルキリージェネレーター 「東方Project」",
      valgene_name_english: "VALKYRIE GENERATOR 「Touhou Project」",
      valgene_id: 15,
      version: 20240805
    },
    {
      valgene_name: "ヴァルキリージェネレーター 第15弾",
      valgene_name_english: "Valkyrie Generator Vol. 15",
      valgene_id: 16,
      version: 20250121
    },
    {
      valgene_name: "ヴァルキリージェネレーター 第16弾",
      valgene_name_english: "Valkyrie Generator Vol. 16",
      valgene_id: 17,
      version: 20250317
    },
    {
      valgene_name: "ヴァルキリージェネレーター 第17弾",
      valgene_name_english: "Valkyrie Generator Vol. 17",
      valgene_id: 18,
      version: 20250924
    }
  ],
  rarity: {
    "11": 5,
    "17": 20,
    "18": 15,
    "19": 10,
    "20": 15,
  },
  catalog: [
    {
      volume: 1,
      items: [
        {
          type: 11, // nemsys crew
          item_ids: [117]
        },
        {
          type: 17, // chat stamp
          item_ids: [1, 2, 3, 4, 5]
        },
        {
          type: 18, // submonitor bg
          item_ids: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]
        },
        {
          type: 19, // bgm
          item_ids: [1, 2, 3, 4, 5, 6, 7, 8]
        },
        {
          type: 20, // nemsys
          item_ids: [1, 2, 3, 4]
        }
      ]
    },
    {
      volume: 2,
      items: [
        {
          type: 11,
          item_ids: [119]
        },
        {
          type: 17,
          item_ids: [6, 7, 8, 9, 10]
        },
        {
          type: 18,
          item_ids: [16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33]
        },
        {
          type: 19,
          item_ids: [9, 10, 11, 12, 13, 14]
        },
        {
          type: 20,
          item_ids: [5, 6, 7]
        }
      ]
    },
    {
      volume: 3,
      items: [
        {
          type: 11,
          item_ids: [120]
        },
        {
          type: 17,
          item_ids: [11, 12, 13, 14, 15, 16]
        },
        {
          type: 18,
          item_ids: [34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56]
        },
        {
          type: 19,
          item_ids: [15, 16, 17]
        },
        {
          type: 20,
          item_ids: [12, 13, 14]
        }
      ]
    },
    {
      volume: 4,
      items: [
        {
          type: 11,
          item_ids: [121]
        },
        {
          type: 17,
          item_ids: [17, 18, 19, 20, 21]
        },
        {
          type: 18,
          item_ids: [57, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79]
        },
        {
          type: 19,
          item_ids: [18, 19, 20, 21]
        },
        {
          type: 20,
          item_ids: [15, 16, 17]
        }
      ]
    },
    {
      volume: 5,
      items: [
        {
          type: 11,
          item_ids: [124]
        },
        {
          type: 17,
          item_ids: [22, 23, 24, 25, 26, 27]
        },
        {
          type: 18,
          item_ids: [80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102]
        },
        {
          type: 19,
          item_ids: [22, 23, 24, 25]
        },
        {
          type: 20,
          item_ids: [18, 19, 20]
        }
      ]
    },
    {
      volume: 6,
      items: [
        {
          type: 11,
          item_ids: [129]
        },
        {
          type: 17,
          item_ids: [28, 29, 30, 31, 32]
        },
        {
          type: 18,
          item_ids: [103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127]
        },
        {
          type: 19,
          item_ids: [26, 27, 28, 29]
        },
        {
          type: 20,
          item_ids: [21, 22, 23, 24, 25]
        }
      ]
    },
    {
      volume: 7,
      items: [
        {
          type: 17,
          item_ids: [34, 35, 36, 37]
        },
        {
          type: 18,
          item_ids: [129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151]
        },
        {
          type: 19,
          item_ids: [30, 31, 32, 33, 34, 35, 36, 37]
        },
        {
          type: 20,
          item_ids: [26, 27, 28, 29, 30]
        }
      ]
    },
    {
      volume: 8,
      items: [
        {
          type: 11,
          item_ids: [130]
        },
        {
          type: 17,
          item_ids: [38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68]
        },
        {
          type: 18,
          item_ids: [152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165]
        },
        {
          type: 19,
          item_ids: [38, 39, 40, 41, 42]
        },
        {
          type: 20,
          item_ids: [31]
        }
      ]
    },
    {
      volume: 9,
      items: [
        {
          type: 11, // nemsys crew
          item_ids: [133]
        },
        {
          type: 17, // chat stamp
          item_ids: [79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109]
        },
        {
          type: 18,  // submonitor bg
          item_ids: [186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 196, 197, 198, 199]
        },
        {
          type: 19, // bgm
          item_ids: [43, 44, 45, 46, 47]
        },
        {
          type: 20, // nemsys
          item_ids: [32]
        }
      ]
    },
    {
      volume: 10,
      items: [
        {
          type: 17,
          item_ids: [120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150]
        },
        {
          type: 18,
          item_ids: [224, 225, 226, 227, 228, 229, 230, 231, 232, 233, 234, 235, 236, 237]
        },
        {
          type: 19,
          item_ids: [48, 49, 50, 51]
        },
        {
          type: 20,
          item_ids: [33, 34]
        }
      ]
    },
    {
      volume: 11,
      items: [
        {
          type: 17,
          item_ids: [163, 164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193]
        },
        {
          type: 18,
          item_ids: [273, 274, 275, 276, 277, 278, 279, 280]
        },
        {
          type: 19,
          item_ids: [52, 53, 54, 55, 56, 57, 58, 59]
        },
        {
          type: 20,
          item_ids: [35, 36, 37, 38, 39, 40, 41, 42]
        }
      ]
    },
    {
      volume: 12,
      items: [
        {
          type: 11,
          item_ids: [141]
        },
        {
          type: 17,
          item_ids: [206, 207, 208, 209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219, 220, 221, 222, 223, 224, 225, 226, 227, 228, 229, 230, 231, 232, 233, 234, 235, 236, 237, 238]
        },
        {
          type: 18,
          item_ids: [347, 348, 349, 350, 351, 352, 353, 354, 355, 356, 357, 358]
        },
        {
          type: 19,
          item_ids: [60, 61, 62, 63]
        },
        {
          type: 20,
          item_ids: [43]
        }
      ]
    },
    {
      volume: 13,
      items: [
        {
          type: 11,
          item_ids: [148]
        },
        {
          type: 17,
          item_ids: [279, 280, 281, 282, 283, 284, 285, 286, 287, 288, 289, 290, 291, 292, 293, 294, 295, 296, 297, 298, 299, 300, 301, 302, 303, 304, 305, 306, 307, 308, 309, 310, 311]
        },
        {
          type: 18,
          item_ids: [397, 398, 399, 400, 401, 402, 403, 404, 405, 406, 407, 408, 409, 410, 411, 412, 413, 414, 415, 416, 417, 418]
        }
      ]
    },
    {
      volume: 14,
      items: [
        {
          type: 17,
          item_ids: [334, 335, 336, 337, 338, 339, 340, 341, 342, 343, 344, 345, 346, 347, 348, 349, 350, 351, 352, 353, 354, 355, 356, 357, 358, 359, 360, 361, 362, 363, 364, 365, 366, 367]
        },
        {
          type: 18,
          item_ids: [456, 457, 458, 459, 460, 461, 462, 463]
        },
        {
          type: 19,
          item_ids: [64, 65, 66, 67, 68, 69, 70, 71]
        },
        {
          type: 20,
          item_ids: [44, 45]
        }
      ]
    },
    {
      volume: 15,
      items: [
        {
          type: 17,
          item_ids: [378, 379, 380, 381, 382, 383]
        },
        {
          type: 18,
          item_ids: [483, 484, 485, 486, 487, 488, 489, 490, 491, 492, 493, 494, 495, 496, 497]
        },
        {
          type: 19,
          item_ids: [72, 73, 74, 75, 76, 77, 78, 79, 80]
        },
        {
          type: 20,
          item_ids: [46]
        }
      ]
    },
    {
      volume: 16,
      items: [
        {
          type: 11,
          item_ids: [165]
        },
        {
          type: 17,
          item_ids: [419, 420, 421, 422, 423, 424]
        },
        {
          type: 18,
          item_ids: [553, 554, 555, 556, 557, 558, 559, 560, 561, 562, 563, 564, 565, 566, 567, 568, 569, 570, 571, 572, 573, 574]
        },
        {
          type: 19,
          item_ids: [81, 82, 83, 84, 85, 86, 87]
        }
      ]
    },
    {
      volume: 17,
      items: [
        {
          type: 11,
          item_ids: [168, 169]
        },
        {
          type: 18,
          item_ids: [617, 618, 619, 620, 621, 622, 623, 624, 625, 626, 627, 628, 629, 630, 631, 632, 633, 634, 635, 636, 637, 638, 639, 640, 641, 642, 643, 644, 645, 646, 647, 648, 649, 650, 651, 652, 653, 654, 655, 656, 657, 658, 659]
        },
        {
          type: 19,
          item_ids: [88, 89, 90, 91, 92]
        }
      ]
    },
    {
      volume: 18,
      items: [
        {
          type: 17,
          item_ids: [495, 496, 497, 498, 499, 500, 501, 502, 503, 504, 505, 506, 507, 508, 509, 510, 511, 512, 513, 514, 515, 516, 517, 518, 519, 520, 521, 522, 523, 524]
        }
      ]
    },
  ]
}

export const PREGENE = [
  {
    id: 1,
    items: {
      'crew': [131],
      'stamp': [69, 70, 71, 72, 73, 74, 75, 76, 77, 78],
      'subbg': [166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182, 183, 184, 185]
    },
    probability: [0.05, 0.39, 0.6]
  },
  {
    id: 2,
    items: {
      'crew': [134],
      'stamp': [110, 111, 112, 113, 114, 115, 116, 117, 118, 119],
      'subbg': [200, 201, 202, 203, 204, 205, 206, 207, 208, 209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219, 220, 221, 222, 223]
    },
    probability: [0.05, 0.39, 0.6]
  },
  {
    id: 3,
    items: {
      'crew': [136, 137, 138],
      'stamp': [151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162],
      'subbg': [238, 239, 240, 241, 242, 243, 244, 245, 246, 247, 248, 249, 250, 251, 252, 253, 254, 255, 256, 257, 258, 259, 260, 261, 262, 263, 264, 265, 266, 267, 268, 269, 270, 271, 272]
    },
    probability: [0.05, 0.39, 0.6]
  },
  {
    id: 4,
    items: {
      'crew': [139],
      'stamp': [194, 195, 196, 197, 198, 199],
      'subbg': [281, 282, 283, 284, 285, 286, 287, 288, 289, 290, 291, 292, 293, 294, 295, 296, 297, 298, 299, 300, 301, 302, 303, 304, 305, 306, 307, 308, 309, 310, 311, 312, 313]
    },
    probability: [0.05, 0.39, 0.6]
  },
  {
    id: 5,
    items: {
      'crew': [140],
      'stamp': [200, 201, 202, 203, 204, 205],
      'subbg': [314, 315, 316, 317, 318, 319, 320, 321, 322, 323, 324, 325, 326, 327, 328, 329, 330, 331, 332, 333, 334, 335, 336, 337, 338, 339, 340, 341, 342, 343, 344, 345, 346]
    },
    probability: [0.05, 0.39, 0.6]
  },
  {
    id: 6,
    items: {
      'crew': [142],
      'stamp': [239, 240, 241, 242, 243, 244, 245, 246, 247, 248],
      'subbg': [359, 360, 361, 362, 363, 364, 365, 366, 367, 368],
      'sysbg': [1, 2, 3]
    },
    probability: [0.05, 0.42, 0.84, 0.9]
  },
  {
    id: 7,
    items: {
      'crew': [143],
      'stamp': [249, 250, 251, 252, 253, 254, 255, 256, 257, 258],
      'subbg': [369, 370, 371, 372, 373, 374, 375, 376, 377, 378, 379, 380, 381]
    },
    probability: [0.05, 0.39, 0.6]
  },
  {
    id: 8,
    items: {
      'crew': [146, 147],
      'stamp': [259, 260, 261, 262, 263, 264, 265, 266, 267, 268, 269, 270, 271, 272, 273, 274, 275, 276, 277, 278],
      'subbg': [382, 383, 384, 385, 386, 387, 388, 389, 390, 391, 392, 393, 394, 395, 396],
      'sysbg': [4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16]
    },
    probability: [0.05, 0.42, 0.84, 0.9]
  },
  {
    id: 9,
    items: {
      "crew": [149],
      "stamp": [312, 313, 314, 315, 316, 317, 318, 319, 320, 321],
      "subbg": [419, 420, 421, 422, 423, 424, 425, 426, 427, 428, 429, 430, 431, 432, 433, 434, 435, 436, 437, 438]
    },
    probability: [0.05, 0.39, 0.6]
  },
  {
    id: 10,
    items: {
      "crew": [150, 151, 152],
      "stamp": [322, 323, 324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      "subbg": [439, 440, 441, 442, 443, 444, 445, 446, 447, 448, 449, 450, 451, 452, 453, 454, 455],
      "sysbg": [17, 18, 19]
    },
    probability: [0.05, 0.39, 0.6, 0.9]
  },
  {
    id: 11,
    items: {
      "crew": [160],
      "stamp": [368, 369, 370, 371, 372, 373, 374, 375, 376, 377],
      "subbg": [464, 465, 466, 467, 468, 469, 470, 471, 472, 473, 474, 475, 476, 477, 478, 479, 480, 481, 482]
    },
    probability: [0.05, 0.39, 0.6]
  },
  {
    id: 12,
    items: {
      "crew": [161],
      "stamp": [384, 385, 386, 387, 388, 389, 390, 391, 392, 393, 394, 395, 396],
      "subbg": [498, 499, 500, 501, 502, 503, 504, 505, 506, 507, 508, 509, 510, 511, 512, 513, 514]
    },
    probability: [0.05, 0.39, 0.6]
  },
  {
    id: 13,
    items: {
      "crew": [162, 163],
      "stamp": [397, 398, 399, 400, 401, 402, 403, 404, 405, 406, 407, 408],
      "subbg": [515, 516, 517, 518, 519, 520, 521, 522, 523, 524, 525, 526, 527, 528, 529, 530, 531]
    },
    probability: [0.05, 0.39, 0.6]
  },
  {
    id: 14,
    items: {
      "crew": [164],
      "stamp": [409, 410, 411, 412, 413, 414, 415, 416, 417, 418],
      "subbg": [532, 533, 534, 535, 536, 537, 538, 539, 540, 541, 542, 543, 544, 545, 546, 547, 548, 549, 550, 551, 552]
    },
    probability: [0.05, 0.39, 0.6]
  },
  {
    id: 15,
    items: {
      "crew": [166],
      "stamp": [425, 426, 427, 428, 429, 430, 431, 432, 433, 434],
      "subbg": [575, 576, 577, 578, 579, 580, 581, 582, 583, 584, 585, 586, 587, 588, 589, 590, 591, 592, 593, 594]
    },
    probability: [0.05, 0.39, 0.6]
  },
  {
    id: 16,
    items: {
      "crew": [167],
      "stamp": [435, 436, 437, 438, 439, 440, 441, 442, 443, 444],
      "subbg": [595, 596, 597, 598, 599, 600, 601, 602, 603, 604, 605, 606, 607, 608, 609, 610, 611, 612, 613, 614, 615, 616]
    },
    probability: [0.05, 0.39, 0.6]
  },
  {
    id: 17,
    items: {
      "crew": [170],
      "stamp": [445, 446, 447, 448, 449, 450, 451, 452, 453, 454],
      "subbg": [660, 661, 662, 663, 664, 665, 666, 667, 668, 669, 670, 671, 672, 673]
    },
    probability: [0.05, 0.39, 0.6]
  },
  {
    id: 18,
    items: {
      "crew": [172],
      "stamp": [455, 456, 457, 458, 459, 460, 461, 462, 463, 464],
      "subbg": [674, 675, 676, 677, 678, 679, 680, 681, 682, 683, 684, 685, 686, 687, 688, 689, 690, 691, 692, 693, 694]
    },
    probability: [0.05, 0.39, 0.6]
  },
  {
    id: 19,
    items: {
      "crew": [173],
      "stamp": [465, 466, 467, 468, 469, 470, 471, 472, 473, 474],
      "subbg": [695, 696, 697, 698, 699, 700, 701, 702, 703, 704, 705, 706, 707, 708, 709, 710, 711, 712, 713]
    },
    probability: [0.05, 0.39, 0.6]
  },
  {
    id: 20,
    items: {
      "crew": [174],
      "stamp": [475, 476, 477, 478, 479, 480, 481, 482, 483, 484],
      "subbg": [714, 715, 716, 717, 718, 719, 720, 721, 722, 723, 724, 725, 726, 727]
    },
    probability: [0.05, 0.39, 0.6]
  },
  {
    id: 21,
    items: {
      "crew": [175],
      "stamp": [485, 486, 487, 488, 489, 490, 491, 492, 493, 494],
      "subbg": [728, 729, 730, 731, 732, 733, 734, 735, 736, 737, 738, 739, 740, 741]
    },
    probability: [0.05, 0.39, 0.6]
  },
  {
    id: 22,
    items: {
      "crew": [176],
      "stamp": [525, 526, 527, 528, 529, 530, 531, 532, 533, 534],
      "subbg": [742, 743, 744, 745, 746, 747, 748, 749, 750, 751, 752, 753, 754, 755, 756, 757, 758, 759, 760, 761, 762]
    },
    probability: [0.05, 0.39, 0.6]
  }
]
  
export const COURSES6 = [
  {
    id: 1,
    name: 'SKILL ANALYZER 第1回 Aコース',
    version: 20210224,
    isNew: 0,
    hasGod: 1,
    courses: [
      {
        id: 1,
        type: 0,
        name: 'SKILL ANALYZER Level.01',
        level: 1,
        nameID: 1,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1383,
            mty: 0,
          },
          {
            no: 1,
            mid: 334,
            mty: 1,
          },
          {
            no: 2,
            mid: 774,
            mty: 1,
          },
        ],
      },
      {
        id: 2,
        type: 0,
        name: 'SKILL ANALYZER Level.02',
        level: 2,
        nameID: 2,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 74,
            mty: 0,
          },
          {
            no: 1,
            mid: 771,
            mty: 1,
          },
          {
            no: 2,
            mid: 1125,
            mty: 1,
          },
        ],
      },
      {
        id: 3,
        type: 0,
        name: 'SKILL ANALYZER Level.03',
        level: 3,
        nameID: 3,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 784,
            mty: 1,
          },
          {
            no: 1,
            mid: 1126,
            mty: 1,
          },
          {
            no: 2,
            mid: 1075,
            mty: 1,
          },
        ],
      },
      {
        id: 4,
        type: 0,
        name: 'SKILL ANALYZER Level.04',
        level: 4,
        nameID: 4,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 505,
            mty: 1,
          },
          {
            no: 1,
            mid: 1403,
            mty: 1,
          },
          {
            no: 2,
            mid: 609,
            mty: 1,
          },
        ],
      },
      {
        id: 5,
        type: 0,
        name: 'SKILL ANALYZER Level.05',
        level: 5,
        nameID: 5,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 630,
            mty: 1,
          },
          {
            no: 1,
            mid: 1598,
            mty: 1,
          },
          {
            no: 2,
            mid: 1475,
            mty: 1,
          },
        ],
      },
      {
        id: 6,
        type: 0,
        name: 'SKILL ANALYZER Level.06',
        level: 6,
        nameID: 6,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1154,
            mty: 2,
          },
          {
            no: 1,
            mid: 1238,
            mty: 2,
          },
          {
            no: 2,
            mid: 590,
            mty: 2,
          },
        ],
      },
      {
        id: 7,
        type: 0,
        name: 'SKILL ANALYZER Level.07',
        level: 7,
        nameID: 7,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1606,
            mty: 2,
          },
          {
            no: 1,
            mid: 834,
            mty: 2,
          },
          {
            no: 2,
            mid: 820,
            mty: 4,
          },
        ],
      },
      {
        id: 8,
        type: 0,
        name: 'SKILL ANALYZER Level.08',
        level: 8,
        nameID: 8,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 183,
            mty: 2,
          },
          {
            no: 1,
            mid: 1602,
            mty: 2,
          },
          {
            no: 2,
            mid: 173,
            mty: 2,
          },
        ],
      },
      {
        id: 9,
        type: 0,
        name: 'SKILL ANALYZER Level.09',
        level: 9,
        nameID: 9,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1418,
            mty: 4,
          },
          {
            no: 1,
            mid: 469,
            mty: 2,
          },
          {
            no: 2,
            mid: 1413,
            mty: 4,
          },
        ],
      },
      {
        id: 10,
        type: 0,
        name: 'SKILL ANALYZER Level.10',
        level: 10,
        nameID: 10,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1596,
            mty: 4,
          },
          {
            no: 1,
            mid: 1649,
            mty: 4,
          },
          {
            no: 2,
            mid: 229,
            mty: 2,
          },
        ],
      },
      {
        id: 11,
        type: 1,
        name: 'SKILL ANALYZER Level.11',
        level: 11,
        nameID: 11,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1651,
            mty: 4,
          },
          {
            no: 1,
            mid: 1105,
            mty: 4,
          },
          {
            no: 2,
            mid: 1152,
            mty: 4,
          },
        ],
      },
      {
        id: 12,
        type: 1,
        name: 'SKILL ANALYZER Level.∞',
        level: 12,
        nameID: 12,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1664,
            mty: 4,
          },
          {
            no: 1,
            mid: 1528,
            mty: 4,
          },
          {
            no: 2,
            mid: 1185,
            mty: 4,
          },
        ],
      }
    ],
  },
  {
    id: 2,
    name: 'SKILL ANALYZER 第1回 Bコース',
    version: 20210224,
    isNew: 0,
    hasGod: 1,
    courses: [
      {
        id: 1,
        type: 0,
        name: 'SKILL ANALYZER Level.01',
        level: 1,
        nameID: 1,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1066,
            mty: 0,
          },
          {
            no: 1,
            mid: 1054,
            mty: 1,
          },
          {
            no: 2,
            mid: 1055,
            mty: 0,
          },
        ],
      },
      {
        id: 2,
        type: 0,
        name: 'SKILL ANALYZER Level.02',
        level: 2,
        nameID: 2,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 768,
            mty: 1,
          },
          {
            no: 1,
            mid: 948,
            mty: 1,
          },
          {
            no: 2,
            mid: 755,
            mty: 1,
          },
        ],
      },
      {
        id: 3,
        type: 0,
        name: 'SKILL ANALYZER Level.03',
        level: 3,
        nameID: 3,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 401,
            mty: 1,
          },
          {
            no: 1,
            mid: 1320,
            mty: 1,
          },
          {
            no: 2,
            mid: 485,
            mty: 1,
          },
        ],
      },
      {
        id: 4,
        type: 0,
        name: 'SKILL ANALYZER Level.04',
        level: 4,
        nameID: 4,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 295,
            mty: 1,
          },
          {
            no: 1,
            mid: 255,
            mty: 1,
          },
          {
            no: 2,
            mid: 1029,
            mty: 1,
          },
        ],
      },
      {
        id: 5,
        type: 0,
        name: 'SKILL ANALYZER Level.05',
        level: 5,
        nameID: 5,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1420,
            mty: 1,
          },
          {
            no: 1,
            mid: 1001,
            mty: 2,
          },
          {
            no: 2,
            mid: 1611,
            mty: 1,
          },
        ],
      },
      {
        id: 6,
        type: 0,
        name: 'SKILL ANALYZER Level.06',
        level: 6,
        nameID: 6,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1338,
            mty: 2,
          },
          {
            no: 1,
            mid: 79,
            mty: 2,
          },
          {
            no: 2,
            mid: 1151,
            mty: 2,
          },
        ],
      },
      {
        id: 7,
        type: 0,
        name: 'SKILL ANALYZER Level.07',
        level: 7,
        nameID: 7,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1047,
            mty: 2,
          },
          {
            no: 1,
            mid: 982,
            mty: 2,
          },
          {
            no: 2,
            mid: 1042,
            mty: 2,
          },
        ],
      },
      {
        id: 8,
        type: 0,
        name: 'SKILL ANALYZER Level.08',
        level: 8,
        nameID: 8,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 664,
            mty: 2,
          },
          {
            no: 1,
            mid: 1370,
            mty: 2,
          },
          {
            no: 2,
            mid: 838,
            mty: 2,
          },
        ],
      },
      {
        id: 9,
        type: 0,
        name: 'SKILL ANALYZER Level.09',
        level: 9,
        nameID: 9,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 624,
            mty: 2,
          },
          {
            no: 1,
            mid: 1113,
            mty: 4,
          },
          {
            no: 2,
            mid: 1629,
            mty: 4,
          },
        ],
      },
      {
        id: 10,
        type: 0,
        name: 'SKILL ANALYZER Level.10',
        level: 10,
        nameID: 10,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1595,
            mty: 4,
          },
          {
            no: 1,
            mid: 1657,
            mty: 4,
          },
          {
            no: 2,
            mid: 658,
            mty: 2,
          },
        ],
      },
      {
        id: 11,
        type: 1,
        name: 'SKILL ANALYZER Level.11',
        level: 11,
        nameID: 11,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1647,
            mty: 4,
          },
          {
            no: 1,
            mid: 1587,
            mty: 4,
          },
          {
            no: 2,
            mid: 333,
            mty: 3,
          },
        ],
      },
      {
        id: 12,
        type: 1,
        name: 'SKILL ANALYZER Level.∞',
        level: 12,
        nameID: 12,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1363,
            mty: 4,
          },
          {
            no: 1,
            mid: 692,
            mty: 3,
          },
          {
            no: 2,
            mid: 1270,
            mty: 4,
          },
        ],
      },
    ]
  },
  {
    id: 3,
    name: 'SKILL ANALYZER 第1回 Cコース',
    version: 20210224,
    isNew: 0,
    hasGod: 1,
    courses: [
      {
        id: 1,
        type: 0,
        name: 'SKILL ANALYZER Level.01',
        level: 1,
        nameID: 1,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1376,
            mty: 0,
          },
          {
            no: 1,
            mid: 564,
            mty: 1,
          },
          {
            no: 2,
            mid: 87,
            mty: 1,
          },
        ],
      },
      {
        id: 2,
        type: 0,
        name: 'SKILL ANALYZER Level.02',
        level: 2,
        nameID: 2,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 34,
            mty: 1,
          },
          {
            no: 1,
            mid: 932,
            mty: 1,
          },
          {
            no: 2,
            mid: 945,
            mty: 1,
          },
        ],
      },
      {
        id: 3,
        type: 0,
        name: 'SKILL ANALYZER Level.03',
        level: 3,
        nameID: 3,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1132,
            mty: 1,
          },
          {
            no: 1,
            mid: 1549,
            mty: 1,
          },
          {
            no: 2,
            mid: 380,
            mty: 1,
          },
        ],
      },
      {
        id: 4,
        type: 0,
        name: 'SKILL ANALYZER Level.04',
        level: 4,
        nameID: 4,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 130,
            mty: 1,
          },
          {
            no: 1,
            mid: 1204,
            mty: 1,
          },
          {
            no: 2,
            mid: 1424,
            mty: 1,
          },
        ],
      },
      {
        id: 5,
        type: 0,
        name: 'SKILL ANALYZER Level.05',
        level: 5,
        nameID: 5,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 48,
            mty: 2,
          },
          {
            no: 1,
            mid: 565,
            mty: 2,
          },
          {
            no: 2,
            mid: 1109,
            mty: 2,
          },
        ],
      },
      {
        id: 6,
        type: 0,
        name: 'SKILL ANALYZER Level.06',
        level: 6,
        nameID: 6,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1534,
            mty: 2,
          },
          {
            no: 1,
            mid: 1398,
            mty: 2,
          },
          {
            no: 2,
            mid: 1312,
            mty: 2,
          },
        ],
      },
      {
        id: 7,
        type: 0,
        name: 'SKILL ANALYZER Level.07',
        level: 7,
        nameID: 7,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 962,
            mty: 2,
          },
          {
            no: 1,
            mid: 1560,
            mty: 2,
          },
          {
            no: 2,
            mid: 357,
            mty: 2,
          },
        ],
      },
      {
        id: 8,
        type: 0,
        name: 'SKILL ANALYZER Level.08',
        level: 8,
        nameID: 8,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 965,
            mty: 2,
          },
          {
            no: 1,
            mid: 906,
            mty: 2,
          },
          {
            no: 2,
            mid: 579,
            mty: 2,
          },
        ],
      },
      {
        id: 9,
        type: 0,
        name: 'SKILL ANALYZER Level.09',
        level: 9,
        nameID: 9,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 332,
            mty: 2,
          },
          {
            no: 1,
            mid: 36,
            mty: 2,
          },
          {
            no: 2,
            mid: 1476,
            mty: 4,
          },
        ],
      },
      {
        id: 10,
        type: 0,
        name: 'SKILL ANALYZER Level.10',
        level: 10,
        nameID: 10,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1533,
            mty: 4,
          },
          {
            no: 1,
            mid: 1597,
            mty: 4,
          },
          {
            no: 2,
            mid: 1541,
            mty: 4,
          },
        ],
      }
    ]
  },
  {
    id: 4,
    name: 'SKILL ANALYZER 第2回',
    version: 20220214,
    isNew: 0,
    hasGod: 1,
    courses: [
      {
        id: 1,
        type: 0,
        name: 'SKILL ANALYZER Level.01',
        level: 1,
        nameID: 1,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1374,
            mty: 0,
          },
          {
            no: 1,
            mid: 936,
            mty: 1,
          },
          {
            no: 2,
            mid: 314,
            mty: 1,
          },
        ],
      },
      {
        id: 2,
        type: 0,
        name: 'SKILL ANALYZER Level.02',
        level: 2,
        nameID: 2,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1221,
            mty: 0,
          },
          {
            no: 1,
            mid: 169,
            mty: 1,
          },
          {
            no: 2,
            mid: 254,
            mty: 1,
          },
        ],
      },
      {
        id: 3,
        type: 0,
        name: 'SKILL ANALYZER Level.03',
        level: 3,
        nameID: 3,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1429,
            mty: 1,
          },
          {
            no: 1,
            mid: 462,
            mty: 1,
          },
          {
            no: 2,
            mid: 237,
            mty: 1,
          },
        ],
      },
      {
        id: 4,
        type: 0,
        name: 'SKILL ANALYZER Level.04',
        level: 4,
        nameID: 4,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 449,
            mty: 1,
          },
          {
            no: 1,
            mid: 329,
            mty: 1,
          },
          {
            no: 2,
            mid: 1293,
            mty: 1,
          },
        ],
      },
      {
        id: 5,
        type: 0,
        name: 'SKILL ANALYZER Level.05',
        level: 5,
        nameID: 5,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 486,
            mty: 2,
          },
          {
            no: 1,
            mid: 920,
            mty: 2,
          },
          {
            no: 2,
            mid: 1318,
            mty: 2,
          },
        ],
      },
      {
        id: 6,
        type: 0,
        name: 'SKILL ANALYZER Level.06',
        level: 6,
        nameID: 6,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1288,
            mty: 2,
          },
          {
            no: 1,
            mid: 256,
            mty: 2,
          },
          {
            no: 2,
            mid:1445,
            mty: 2,
          },
        ],
      },
      {
        id: 7,
        type: 0,
        name: 'SKILL ANALYZER Level.07',
        level: 7,
        nameID: 7,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1129,
            mty: 2,
          },
          {
            no: 1,
            mid: 1349,
            mty: 2,
          },
          {
            no: 2,
            mid: 1608,
            mty: 2,
          },
        ],
      },
      {
        id: 8,
        type: 0,
        name: 'SKILL ANALYZER Level.08',
        level: 8,
        nameID: 8,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 492,
            mty: 2,
          },
          {
            no: 1,
            mid: 930,
            mty: 4,
          },
          {
            no: 2,
            mid: 651,
            mty: 2,
          },
        ],
      },
      {
        id: 9,
        type: 0,
        name: 'SKILL ANALYZER Level.09',
        level: 9,
        nameID: 9,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1607,
            mty: 2,
          },
          {
            no: 1,
            mid: 1240,
            mty: 2,
          },
          {
            no: 2,
            mid: 510,
            mty: 2,
          },
        ],
      },
      {
        id: 10,
        type: 0,
        name: 'SKILL ANALYZER Level.10',
        level: 10,
        nameID: 10,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1251,
            mty: 4,
          },
          {
            no: 1,
            mid: 1540,
            mty: 4,
          },
          {
            no: 2,
            mid: 1712,
            mty: 4,
          },
        ],
      },
      {
        id: 11,
        type: 1,
        name: 'SKILL ANALYZER Level.11',
        level: 11,
        nameID: 11,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1143,
            mty: 4,
          },
          {
            no: 1,
            mid: 1298,
            mty: 4,
          },
          {
            no: 2,
            mid: 1619,
            mty: 4,
          },
        ],
      },
      {
        id: 12,
        type: 1,
        name: 'SKILL ANALYZER Level.∞',
        level: 12,
        nameID: 12,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1639,
            mty: 4,
          },
          {
            no: 1,
            mid: 1496,
            mty: 4,
          },
          {
            no: 2,
            mid: 1766,
            mty: 4,
          },
        ],
      }
    ],
  },
  {
    id: 5,
    name: 'SKILL ANALYZER 第3回',
    version: 20220308,
    isNew: 0,
    hasGod: 1,
    courses: [
      {
        id: 1,
        type: 0,
        name: 'SKILL ANALYZER Level.01',
        level: 1,
        nameID: 1,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1718,
            mty: 0,
          },
          {
            no: 1,
            mid: 144,
            mty: 1,
          },
          {
            no: 2,
            mid: 568,
            mty: 1,
          },
        ],
      },
      {
        id: 2,
        type: 0,
        name: 'SKILL ANALYZER Level.02',
        level: 2,
        nameID: 2,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1659,
            mty: 0,
          },
          {
            no: 1,
            mid: 739,
            mty: 1,
          },
          {
            no: 2,
            mid: 561,
            mty: 1,
          },
        ],
      },
      {
        id: 3,
        type: 0,
        name: 'SKILL ANALYZER Level.03',
        level: 3,
        nameID: 3,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1110,
            mty: 1,
          },
          {
            no: 1,
            mid: 1513,
            mty: 1,
          },
          {
            no: 2,
            mid: 732,
            mty: 1,
          },
        ],
      },
      {
        id: 4,
        type: 0,
        name: 'SKILL ANALYZER Level.04',
        level: 4,
        nameID: 4,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 174,
            mty: 1,
          },
          {
            no: 1,
            mid: 1217,
            mty: 1,
          },
          {
            no: 2,
            mid: 617,
            mty: 1,
          },
        ],
      },
      {
        id: 5,
        type: 0,
        name: 'SKILL ANALYZER Level.05',
        level: 5,
        nameID: 5,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1564,
            mty: 1,
          },
          {
            no: 1,
            mid: 1679,
            mty: 1,
          },
          {
            no: 2,
            mid: 285,
            mty: 2,
          },
        ],
      },
      {
        id: 6,
        type: 0,
        name: 'SKILL ANALYZER Level.06',
        level: 6,
        nameID: 6,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 545,
            mty: 2,
          },
          {
            no: 1,
            mid: 1563,
            mty: 2,
          },
          {
            no: 2,
            mid: 916,
            mty: 2,
          },
        ],
      },
      {
        id: 7,
        type: 0,
        name: 'SKILL ANALYZER Level.07',
        level: 7,
        nameID: 7,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 866,
            mty: 2,
          },
          {
            no: 1,
            mid: 330,
            mty: 2,
          },
          {
            no: 2,
            mid: 669,
            mty: 2,
          },
        ],
      },
      {
        id: 8,
        type: 0,
        name: 'SKILL ANALYZER Level.08',
        level: 8,
        nameID: 8,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 399,
            mty: 2,
          },
          {
            no: 1,
            mid: 1166,
            mty: 2,
          },
          {
            no: 2,
            mid: 1305,
            mty: 3,
          },
        ],
      },
      {
        id: 9,
        type: 0,
        name: 'SKILL ANALYZER Level.09',
        level: 9,
        nameID: 9,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 882,
            mty: 4,
          },
          {
            no: 1,
            mid: 1759,
            mty: 4,
          },
          {
            no: 2,
            mid: 993,
            mty: 4,
          },
        ],
      },
      
      
      {
        id: 10,
        type: 0,
        name: 'SKILL ANALYZER Level.10',
        level: 10,
        nameID: 10,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1644,
            mty: 4,
          },
          {
            no: 1,
            mid: 1331,
            mty: 4,
          },
          {
            no: 2,
            mid: 1625,
            mty: 4,
          },
        ],
      },
      {
        id: 11,
        type: 1,
        name: 'SKILL ANALYZER Level.11',
        level: 11,
        nameID: 11,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1550,
            mty: 3,
          },
          {
            no: 1,
            mid: 1366,
            mty: 4,
          },
          {
            no: 2,
            mid: 1722,
            mty: 4,
          },
        ],
      },
      {
        id: 12,
        type: 1,
        name: 'SKILL ANALYZER Level.∞',
        level: 12,
        nameID: 12,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 495,
            mty: 3,
          },
          {
            no: 1,
            mid: 1464,
            mty: 4,
          },
          {
            no: 2,
            mid: 1767,
            mty: 4,
          },
        ],
      },
    ]
  },
  {
    id: 6,
    name: '10周年記念コース',
    version: 20220117,
    isNew: 0,
    courses: [
      {
        id: 1,
        type: 0,
        name: '10周年記念コース(梅)',
        level: 0,
        nameID: 14,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 247,
            mty: 0,
          },
          {
            no: 1,
            mid: 611,
            mty: 0,
          },
          {
            no: 2,
            mid: 339,
            mty: 0,
          },
        ],
      },
      {
        id: 2,
        type: 0,
        name: '10周年記念コース(竹)',
        level: 0,
        nameID: 14,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 247,
            mty: 1,
          },
          {
            no: 1,
            mid: 611,
            mty: 1,
          },
          {
            no: 2,
            mid: 339,
            mty: 1,
          },
        ],
      },
      {
        id: 3,
        type: 0,
        name: '10周年記念コース(松)',
        level: 0,
        nameID: 14,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 247,
            mty: 2,
          },
          {
            no: 1,
            mid: 611,
            mty: 2,
          },
          {
            no: 2,
            mid: 339,
            mty: 2,
          },
        ],
      },
      {
        id: 4,
        type: 0,
        name: '10周年記念コース(極)',
        level: 0,
        nameID: 14,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 793,
            mty: 2,
          },
          {
            no: 1,
            mid: 247,
            mty: 3,
          },
          {
            no: 2,
            mid: 339,
            mty: 3,
          },
        ],
      },
    ]
  },
  {
    id: 7,
    name: '新生活応援コース',
    version: 20220323,
    isNew: 0,
    courses: [
      {
        id: 1,
        type: 0,
        name: '新生活応援コース(入学)',
        level: 0,
        nameID: 15,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 239,
            mty: 0,
          },
          {
            no: 1,
            mid: 437,
            mty: 0,
          },
          {
            no: 2,
            mid: 1705,
            mty: 0,
          },
        ],
      },
      {
        id: 2,
        type: 0,
        name: '新生活応援コース(進学)',
        level: 0,
        nameID: 15,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 239,
            mty: 1,
          },
          {
            no: 1,
            mid: 437,
            mty: 1,
          },
          {
            no: 2,
            mid: 1705,
            mty: 1,
          },
        ],
      },
      {
        id: 3,
        type: 0,
        name: '新生活応援コース(就職)',
        level: 0,
        nameID: 15,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 239,
            mty: 2,
          },
          {
            no: 1,
            mid: 437,
            mty: 2,
          },
          {
            no: 2,
            mid: 1705,
            mty: 4,
          },
        ],
      },
      {
        id: 4,
        type: 0,
        name: '新生活応援コース(新年度受講生大募集)',
        level: 0,
        nameID: 15,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 840,
            mty: 3,
          },
          {
            no: 1,
            mid: 1219,
            mty: 3,
          },
          {
            no: 2,
            mid: 1751,
            mty: 4,
          },
        ],
      },
    ]
  },
  {
    id: 8,
    name: 'SKILL ANALYZER 第4回 Aコース',
    version: 20220425,
    isNew: 0,
    hasGod: 1,
    courses: [
      {
        id: 1,
        type: 0,
        name: 'SKILL ANALYZER Level.01',
        level: 1,
        nameID: 1,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 271,
            mty: 0,
          },
          {
            no: 1,
            mid: 209,
            mty: 1,
          },
          {
            no: 2,
            mid: 1083,
            mty: 1,
          },
        ],
      },
      {
        id: 2,
        type: 0,
        name: 'SKILL ANALYZER Level.02',
        level: 2,
        nameID: 2,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1088,
            mty: 1,
          },
          {
            no: 1,
            mid: 973,
            mty: 1,
          },
          {
            no: 2,
            mid: 22,
            mty: 1,
          },
        ],
      },
      {
        id: 3,
        type: 0,
        name: 'SKILL ANALYZER Level.03',
        level: 3,
        nameID: 3,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 157,
            mty: 1,
          },
          {
            no: 1,
            mid: 1039,
            mty: 1,
          },
          {
            no: 2,
            mid: 972,
            mty: 1,
          },
        ],
      },
      {
        id: 4,
        type: 0,
        name: 'SKILL ANALYZER Level.04',
        level: 4,
        nameID: 4,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1395,
            mty: 1,
          },
          {
            no: 1,
            mid: 238,
            mty: 2,
          },
          {
            no: 2,
            mid: 1342,
            mty: 1,
          },
        ],
      },
      {
        id: 5,
        type: 0,
        name: 'SKILL ANALYZER Level.05',
        level: 5,
        nameID: 5,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 283,
            mty: 2,
          },
          {
            no: 1,
            mid: 1551,
            mty: 1,
          },
          {
            no: 2,
            mid: 573,
            mty: 2,
          },
        ],
      },
      {
        id: 6,
        type: 0,
        name: 'SKILL ANALYZER Level.06',
        level: 6,
        nameID: 6,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1565,
            mty: 2,
          },
          {
            no: 1,
            mid: 1409,
            mty: 2,
          },
          {
            no: 2,
            mid: 202,
            mty: 2,
          },
        ],
      },
      {
        id: 7,
        type: 0,
        name: 'SKILL ANALYZER Level.07',
        level: 7,
        nameID: 7,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1250,
            mty: 2,
          },
          {
            no: 1,
            mid: 434,
            mty: 2,
          },
          {
            no: 2,
            mid: 690,
            mty: 2,
          },
        ],
      },
      {
        id: 8,
        type: 0,
        name: 'SKILL ANALYZER Level.08',
        level: 8,
        nameID: 8,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 460,
            mty: 2,
          },
          {
            no: 1,
            mid: 772,
            mty: 2,
          },
          {
            no: 2,
            mid: 891,
            mty: 4,
          },
        ],
      },
      {
        id: 9,
        type: 0,
        name: 'SKILL ANALYZER Level.09',
        level: 9,
        nameID: 9,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 234,
            mty: 2,
          },
          {
            no: 1,
            mid: 886,
            mty: 4,
          },
          {
            no: 2,
            mid: 1716,
            mty: 4,
          },
        ],
      },
      {
        id: 10,
        type: 0,
        name: 'SKILL ANALYZER Level.10',
        level: 10,
        nameID: 10,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1760,
            mty: 4,
          },
          {
            no: 1,
            mid: 730,
            mty: 2,
          },
          {
            no: 2,
            mid: 1405,
            mty: 4,
          },
        ],
      },
      {
        id: 11,
        type: 1,
        name: 'SKILL ANALYZER Level.11',
        level: 11,
        nameID: 11,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1776,
            mty: 4,
          },
          {
            no: 1,
            mid: 1365,
            mty: 4,
          },
          {
            no: 2,
            mid: 911,
            mty: 3,
          },
        ],
      },
      {
        id: 12,
        type: 1,
        name: 'SKILL ANALYZER Level.∞',
        level: 12,
        nameID: 12,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1364,
            mty: 4,
          },
          {
            no: 1,
            mid: 1661,
            mty: 4,
          },
          {
            no: 2,
            mid: 1099,
            mty: 4,
          },
        ],
      },
    ]
  },
  {
    id: 9,
    name: 'SKILL ANALYZER 第4回 Bコース',
    version: 20220425,
    isNew: 0,
    hasGod: 1,
    courses: [
      {
        id: 1,
        type: 0,
        name: 'SKILL ANALYZER Level.01',
        level: 1,
        nameID: 1,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1526,
            mty: 0,
          },
          {
            no: 1,
            mid: 84,
            mty: 1,
          },
          {
            no: 2,
            mid: 76,
            mty: 1,
          },
        ],
      },
      {
        id: 2,
        type: 0,
        name: 'SKILL ANALYZER Level.02',
        level: 2,
        nameID: 2,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 171,
            mty: 1,
          },
          {
            no: 1,
            mid: 474,
            mty: 1,
          },
          {
            no: 2,
            mid: 18,
            mty: 1,
          },
        ],
      },
      {
        id: 3,
        type: 0,
        name: 'SKILL ANALYZER Level.03',
        level: 3,
        nameID: 3,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 281,
            mty: 1,
          },
          {
            no: 1,
            mid: 1254,
            mty: 1,
          },
          {
            no: 2,
            mid: 997,
            mty: 1,
          },
        ],
      },
      {
        id: 4,
        type: 0,
        name: 'SKILL ANALYZER Level.04',
        level: 4,
        nameID: 4,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 417,
            mty: 1,
          },
          {
            no: 1,
            mid: 1572,
            mty: 1,
          },
          {
            no: 2,
            mid: 539,
            mty: 1,
          },
        ],
      },
      {
        id: 5,
        type: 0,
        name: 'SKILL ANALYZER Level.05',
        level: 5,
        nameID: 5,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1701,
            mty: 1,
          },
          {
            no: 1,
            mid: 523,
            mty: 2,
          },
          {
            no: 2,
            mid: 477,
            mty: 2,
          },
        ],
      },
      {
        id: 6,
        type: 0,
        name: 'SKILL ANALYZER Level.06',
        level: 6,
        nameID: 6,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1412,
            mty: 2,
          },
          {
            no: 1,
            mid: 1417,
            mty: 2,
          },
          {
            no: 2,
            mid: 1081,
            mty: 2,
          },
        ],
      },
      {
        id: 7,
        type: 0,
        name: 'SKILL ANALYZER Level.07',
        level: 7,
        nameID: 7,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 315,
            mty: 2,
          },
          {
            no: 1,
            mid: 861,
            mty: 4,
          },
          {
            no: 2,
            mid: 1303,
            mty: 2,
          },
        ],
      },
      {
        id: 8,
        type: 0,
        name: 'SKILL ANALYZER Level.08',
        level: 8,
        nameID: 8,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 484,
            mty: 2,
          },
          {
            no: 1,
            mid: 905,
            mty: 2,
          },
          {
            no: 2,
            mid: 1539,
            mty: 4,
          },
        ],
      },
      {
        id: 9,
        type: 0,
        name: 'SKILL ANALYZER Level.09',
        level: 9,
        nameID: 9,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1019,
            mty: 4,
          },
          {
            no: 1,
            mid: 943,
            mty: 4,
          },
          {
            no: 2,
            mid: 1208,
            mty: 4,
          },
        ],
      },
      {
        id: 10,
        type: 0,
        name: 'SKILL ANALYZER Level.10',
        level: 10,
        nameID: 10,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 786,
            mty: 2,
          },
          {
            no: 1,
            mid: 837,
            mty: 2,
          },
          {
            no: 2,
            mid: 1814,
            mty: 4,
          },
        ],
      },
      {
        id: 11,
        type: 1,
        name: 'SKILL ANALYZER Level.11',
        level: 11,
        nameID: 11,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 979,
            mty: 3,
          },
          {
            no: 1,
            mid: 1459,
            mty: 4,
          },
          {
            no: 2,
            mid: 1774,
            mty: 4,
          },
        ],
      },
      {
        id: 12,
        type: 1,
        name: 'SKILL ANALYZER Level.∞',
        level: 12,
        nameID: 12,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 914,
            mty: 3,
          },
          {
            no: 1,
            mid: 376,
            mty: 3,
          },
          {
            no: 2,
            mid: 1362,
            mty: 4,
          },
        ],
      },
    ]
  },
  {
    id: 10,
    name: 'SKILL ANALYZER 第5回 Aコース',
    version: 20220816,
    isNew: 0,
    hasGod: 1,
    courses: [
      {
        id: 1,
        type: 0,
        name: 'SKILL ANALYZER Level.01',
        level: 1,
        nameID: 1,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1441,
            mty: 0,
          },
          {
            no: 1,
            mid: 274,
            mty: 1,
          },
          {
            no: 2,
            mid: 569,
            mty: 1,
          },
        ],
      },
      {
        id: 2,
        type: 0,
        name: 'SKILL ANALYZER Level.02',
        level: 2,
        nameID: 2,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1057,
            mty: 1,
          },
          {
            no: 1,
            mid: 865,
            mty: 1,
          },
          {
            no: 2,
            mid: 721,
            mty: 1,
          },
        ],
      },
      {
        id: 3,
        type: 0,
        name: 'SKILL ANALYZER Level.03',
        level: 3,
        nameID: 3,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 673,
            mty: 1,
          },
          {
            no: 1,
            mid: 954,
            mty: 1,
          },
          {
            no: 2,
            mid: 1867,
            mty: 1,
          },
        ],
      },
      {
        id: 4,
        type: 0,
        name: 'SKILL ANALYZER Level.04',
        level: 4,
        nameID: 4,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 461,
            mty: 1,
          },
          {
            no: 1,
            mid: 538,
            mty: 1,
          },
          {
            no: 2,
            mid: 1510,
            mty: 1,
          },
        ],
      },
      {
        id: 5,
        type: 0,
        name: 'SKILL ANALYZER Level.05',
        level: 5,
        nameID: 5,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1300,
            mty: 1,
          },
          {
            no: 1,
            mid: 1697,
            mty: 1,
          },
          {
            no: 2,
            mid: 476,
            mty: 2,
          },
        ],
      },
      {
        id: 6,
        type: 0,
        name: 'SKILL ANALYZER Level.06',
        level: 6,
        nameID: 6,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1115,
            mty: 2,
          },
          {
            no: 1,
            mid: 1425,
            mty: 2,
          },
          {
            no: 2,
            mid: 756,
            mty: 2,
          },
        ],
      },
      {
        id: 7,
        type: 0,
        name: 'SKILL ANALYZER Level.07',
        level: 7,
        nameID: 7,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 411,
            mty: 2,
          },
          {
            no: 1,
            mid: 990,
            mty: 4,
          },
          {
            no: 2,
            mid: 192,
            mty: 2,
          },
        ],
      },
      {
        id: 8,
        type: 0,
        name: 'SKILL ANALYZER Level.08',
        level: 8,
        nameID: 8,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 778,
            mty: 2,
          },
          {
            no: 1,
            mid: 1727,
            mty: 2,
          },
          {
            no: 2,
            mid: 1127,
            mty: 4,
          },
        ],
      },
      {
        id: 9,
        type: 0,
        name: 'SKILL ANALYZER Level.09',
        level: 9,
        nameID: 9,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 737,
            mty: 2,
          },
          {
            no: 1,
            mid: 1485,
            mty: 4,
          },
          {
            no: 2,
            mid: 1262,
            mty: 2,
          },
        ],
      },
      {
        id: 10,
        type: 0,
        name: 'SKILL ANALYZER Level.10',
        level: 10,
        nameID: 10,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 832,
            mty: 2,
          },
          {
            no: 1,
            mid: 1749,
            mty: 4,
          },
          {
            no: 2,
            mid: 633,
            mty: 2,
          },
        ],
      },
      {
        id: 11,
        type: 1,
        name: 'SKILL ANALYZER Level.11',
        level: 11,
        nameID: 11,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 725,
            mty: 2,
          },
          {
            no: 1,
            mid: 1201,
            mty: 4,
          },
          {
            no: 2,
            mid: 654,
            mty: 2,
          },
        ],
      },
      {
        id: 12,
        type: 1,
        name: 'SKILL ANALYZER Level.∞',
        level: 12,
        nameID: 12,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 704,
            mty: 3,
          },
          {
            no: 1,
            mid: 1176,
            mty: 4,
          },
          {
            no: 2,
            mid: 1889,
            mty: 4,
          },
        ],
      },
    ]
  },
  {
    id: 11,
    name: 'SKILL ANALYZER 第5回 Bコース',
    version: 20220816,
    isNew: 0,
    hasGod: 1,
    courses: [
      {
        id: 1,
        type: 0,
        name: 'SKILL ANALYZER Level.01',
        level: 1,
        nameID: 1,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 698,
            mty: 0,
          },
          {
            no: 1,
            mid: 159,
            mty: 1,
          },
          {
            no: 2,
            mid: 671,
            mty: 1,
          },
        ],
      },
      {
        id: 2,
        type: 0,
        name: 'SKILL ANALYZER Level.02',
        level: 2,
        nameID: 2,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 388,
            mty: 1,
          },
          {
            no: 1,
            mid: 1084,
            mty: 1,
          },
          {
            no: 2,
            mid: 944,
            mty: 1,
          },
        ],
      },
      {
        id: 3,
        type: 0,
        name: 'SKILL ANALYZER Level.03',
        level: 3,
        nameID: 3,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 854,
            mty: 1,
          },
          {
            no: 1,
            mid: 321,
            mty: 1,
          },
          {
            no: 2,
            mid: 512,
            mty: 1,
          },
        ],
      },
      {
        id: 4,
        type: 0,
        name: 'SKILL ANALYZER Level.04',
        level: 4,
        nameID: 4,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 412,
            mty: 1,
          },
          {
            no: 1,
            mid: 992,
            mty: 1,
          },
          {
            no: 2,
            mid: 1315,
            mty: 1,
          },
        ],
      },
      {
        id: 5,
        type: 0,
        name: 'SKILL ANALYZER Level.05',
        level: 5,
        nameID: 5,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1085,
            mty: 2,
          },
          {
            no: 1,
            mid: 1229,
            mty: 2,
          },
          {
            no: 2,
            mid: 212,
            mty: 2,
          },
        ],
      },
      {
        id: 6,
        type: 0,
        name: 'SKILL ANALYZER Level.06',
        level: 6,
        nameID: 6,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1616,
            mty: 2,
          },
          {
            no: 1,
            mid: 1815,
            mty: 2,
          },
          {
            no: 2,
            mid: 813,
            mty: 2,
          },
        ],
      },
      {
        id: 7,
        type: 0,
        name: 'SKILL ANALYZER Level.07',
        level: 7,
        nameID: 7,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1719,
            mty: 2,
          },
          {
            no: 1,
            mid: 344,
            mty: 2,
          },
          {
            no: 2,
            mid: 1322,
            mty: 2,
          },
        ],
      },
      {
        id: 8,
        type: 0,
        name: 'SKILL ANALYZER Level.08',
        level: 8,
        nameID: 8,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1410,
            mty: 2,
          },
          {
            no: 1,
            mid: 1761,
            mty: 2,
          },
          {
            no: 2,
            mid: 63,
            mty: 2,
          },
        ],
      },
      {
        id: 9,
        type: 0,
        name: 'SKILL ANALYZER Level.09',
        level: 9,
        nameID: 9,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 96,
            mty: 2,
          },
          {
            no: 1,
            mid: 976,
            mty: 3,
          },
          {
            no: 2,
            mid: 801,
            mty: 2,
          },
        ],
      },
      {
        id: 10,
        type: 0,
        name: 'SKILL ANALYZER Level.10',
        level: 10,
        nameID: 10,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1729,
            mty: 4,
          },
          {
            no: 1,
            mid: 985,
            mty: 4,
          },
          {
            no: 2,
            mid: 900,
            mty: 3,
          },
        ],
      },
      {
        id: 11,
        type: 1,
        name: 'SKILL ANALYZER Level.11',
        level: 11,
        nameID: 11,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1517,
            mty: 4,
          },
          {
            no: 1,
            mid: 1335,
            mty: 4,
          },
          {
            no: 2,
            mid: 367,
            mty: 2,
          },
        ],
      },
      {
        id: 12,
        type: 1,
        name: 'SKILL ANALYZER Level.∞',
        level: 12,
        nameID: 12,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 273,
            mty: 3,
          },
          {
            no: 1,
            mid: 1581,
            mty: 4,
          },
          {
            no: 2,
            mid: 1888,
            mty: 4,
          },
        ],
      },
    ]
  },
  {
    id: 12,
    name: 'Red Bull 5G 2022予選コース',
    version: 20220511,
    isNew: 0,
    courses: [
      {
        id: 1,
        type: 0,
        name: 'Red Bull 5G 2022 エンジョイコース(梅)',
        level: 0,
        nameID: 16,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1258,
            mty: 0,
          },
          {
            no: 1,
            mid: 1191,
            mty: 0,
          },
          {
            no: 2,
            mid: 915,
            mty: 0,
          },
        ],
      },
      {
        id: 2,
        type: 0,
        name: 'Red Bull 5G 2022 エンジョイコース(竹)',
        level: 0,
        nameID: 16,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1258,
            mty: 1,
          },
          {
            no: 1,
            mid: 1191,
            mty: 1,
          },
          {
            no: 2,
            mid: 915,
            mty: 1,
          },
        ],
      },
      {
        id: 3,
        type: 0,
        name: 'Red Bull 5G 2022 エンジョイコース(松)',
        level: 0,
        nameID: 16,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1258,
            mty: 2,
          },
          {
            no: 1,
            mid: 1191,
            mty: 2,
          },
          {
            no: 2,
            mid: 915,
            mty: 2,
          },
        ],
      },
      {
        id: 4,
        type: 0,
        name: 'Red Bull 5G 2022予選コース',
        level: 0,
        nameID: 16,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1258,
            mty: 4,
          },
          {
            no: 1,
            mid: 1191,
            mty: 4,
          },
          {
            no: 2,
            mid: 915,
            mty: 3,
          },
        ],
      },
    ]
  },
  {
    id: 13,
    name: 'BEMANI MASTER KOREA 2021',
    version: 20211110,
    isNew: 0,
    courses: [
      {
        id: 1,
        type: 0,
        name: 'BEMANI MASTER KOREA 2021 Entry Course',
        level: 0,
        nameID: 13,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1641,
            mty: 4
          },
          {
            no: 1,
            mid: 1646,
            mty: 4
          },
          {
            no: 2,
            mid: 1642,
            mty: 4
          },
        ]
      },
      {
        id: 2,
        type: 0,
        name: 'BEMANI MASTER KOREA 2021 Enjoy Course',
        level: 0,
        nameID: 13,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1641,
            mty: 1
          },
          {
            no: 1,
            mid: 1646,
            mty: 2
          },
          {
            no: 2,
            mid: 1642,
            mty: 2
          },
        ]
      }
    ]
  },
  {
    id: 14,
    name: 'SKILL ANALYZER 第6回',
    version: 20230807,
    isNew: 0,
    hasGod: 1,
    courses: [
      {
        id: 1,
        type: 0,
        name: 'SKILL ANALYZER Level.01',
        level: 1,
        nameID: 1,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1130,
            mty: 0,
          },
          {
            no: 1,
            mid: 182,
            mty: 1,
          },
          {
            no: 2,
            mid: 328,
            mty: 1,
          },
        ],
      },
      {
        id: 2,
        type: 0,
        name: 'SKILL ANALYZER Level.02',
        level: 2,
        nameID: 2,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 515,
            mty: 1,
          },
          {
            no: 1,
            mid: 222,
            mty: 1,
          },
          {
            no: 2,
            mid: 572,
            mty: 1,
          },
        ],
      },
      {
        id: 3,
        type: 0,
        name: 'SKILL ANALYZER Level.03',
        level: 3,
        nameID: 3,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 631,
            mty: 1,
          },
          {
            no: 1,
            mid: 890,
            mty: 1,
          },
          {
            no: 2,
            mid: 1748,
            mty: 1,
          },
        ],
      },
      {
        id: 4,
        type: 0,
        name: 'SKILL ANALYZER Level.04',
        level: 4,
        nameID: 4,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 205,
            mty: 1,
          },
          {
            no: 1,
            mid: 1227,
            mty: 1,
          },
          {
            no: 2,
            mid: 430,
            mty: 1,
          },
        ],
      },
      {
        id: 5,
        type: 0,
        name: 'SKILL ANALYZER Level.05',
        level: 5,
        nameID: 5,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1162,
            mty: 1,
          },
          {
            no: 1,
            mid: 1282,
            mty: 1,
          },
          {
            no: 2,
            mid: 66,
            mty: 2,
          },
        ],
      },
      {
        id: 6,
        type: 0,
        name: 'SKILL ANALYZER Level.06',
        level: 6,
        nameID: 6,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1401,
            mty: 2,
          },
          {
            no: 1,
            mid: 946,
            mty: 2,
          },
          {
            no: 2,
            mid: 928,
            mty: 2,
          },
        ],
      },
      {
        id: 7,
        type: 0,
        name: 'SKILL ANALYZER Level.07',
        level: 7,
        nameID: 7,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1873,
            mty: 2,
          },
          {
            no: 1,
            mid: 1746,
            mty: 2,
          },
          {
            no: 2,
            mid: 1004,
            mty: 4,
          },
        ],
      },
      {
        id: 8,
        type: 0,
        name: 'SKILL ANALYZER Level.08',
        level: 8,
        nameID: 8,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 241,
            mty: 2,
          },
          {
            no: 1,
            mid: 656,
            mty: 2,
          },
          {
            no: 2,
            mid: 1016,
            mty: 4,
          },
        ],
      },
      {
        id: 9,
        type: 0,
        name: 'SKILL ANALYZER Level.09',
        level: 9,
        nameID: 9,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1159,
            mty: 4,
          },
          {
            no: 1,
            mid: 1790,
            mty: 2,
          },
          {
            no: 2,
            mid: 1137,
            mty: 4,
          },
        ],
      },
      {
        id: 10,
        type: 0,
        name: 'SKILL ANALYZER Level.10',
        level: 10,
        nameID: 10,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1806,
            mty: 4,
          },
          {
            no: 1,
            mid: 994,
            mty: 4,
          },
          {
            no: 2,
            mid: 787,
            mty: 2,
          },
        ],
      },
      {
        id: 11,
        type: 1,
        name: 'SKILL ANALYZER Level.11',
        level: 11,
        nameID: 11,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1257,
            mty: 4,
          },
          {
            no: 1,
            mid: 1778,
            mty: 4,
          },
          {
            no: 2,
            mid: 1954,
            mty: 4,
          },
        ],
      },
      {
        id: 12,
        type: 1,
        name: 'SKILL ANALYZER Level.∞',
        level: 12,
        nameID: 12,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1316,
            mty: 4,
          },
          {
            no: 1,
            mid: 1272,
            mty: 4,
          },
          {
            no: 2,
            mid: 2037,
            mty: 4,
          },
        ],
      },
    ]
  },
  {
    id: 15,
    name: '春のボルテ祭りコース2023',
    version: 20230329,
    isNew: 0,
    courses: [
      {
        id: 1,
        type: 0,
        name: '春のボルテ祭りコース2023【梅】',
        level: 0,
        nameID: 17,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1107,
            mty: 0
          },
          {
            no: 1,
            mid: 1180,
            mty: 0
          },
          {
            no: 2,
            mid: 1143,
            mty: 0
          }
        ]
      },
      {
        id: 2,
        type: 0,
        name: '春のボルテ祭りコース2023【竹】',
        level: 0,
        nameID: 17,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1107,
            mty: 1
          },
          {
            no: 1,
            mid: 1180,
            mty: 1
          },
          {
            no: 2,
            mid: 1143,
            mty: 1
          }
        ]
      },
      {
        id: 3,
        type: 0,
        name: '春のボルテ祭りコース2023【松】',
        level: 0,
        nameID: 17,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1107,
            mty: 4
          },
          {
            no: 1,
            mid: 1180,
            mty: 4
          },
          {
            no: 2,
            mid: 1143,
            mty: 4
          }
        ]
      },
      {
        id: 4,
        type: 0,
        name: '春のボルテ祭りコース2023【∞∞(* ▼∀▼)∞∞ ふふ…！】',
        level: 0,
        nameID: 17,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 840,
            mty: 3
          },
          {
            no: 1,
            mid: 1219,
            mty: 3
          },
          {
            no: 2,
            mid: 1751,
            mty: 3
          }
        ]
      }
    ]
  },
  {
    id: 16,
    name: 'KAC(2023)予選コース',
    version: 20230807,
    isNew: 0,
    courses: [
      {
        id: 1,
        type: 3,
        name: 'KAC 2023 チャレンジコース【完喰】',
        level: 0,
        nameID: 18,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 2059,
            mty: 4
          },
          {
            no: 1,
            mid: 694,
            mty: 3
          },
          {
            no: 2,
            mid: 1773,
            mty: 4
          }
        ]
      },
      {
        id: 2,
        type: 3,
        name: 'KAC 2023 エンジョイコース【完喰】',
        level: 0,
        nameID: 18,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 2059,
            mty: 1
          },
          {
            no: 1,
            mid: 694,
            mty: 1
          },
          {
            no: 2,
            mid: 1773,
            mty: 1
          }
        ]
      },
      {
        id: 3,
        type: 3,
        name: 'KAC 2023 チャレンジコース【夢吹】',
        level: 0,
        nameID: 19,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1807,
            mty: 4
          },
          {
            no: 1,
            mid: 1591,
            mty: 4
          },
          {
            no: 2,
            mid: 1770,
            mty: 4
          }
        ]
      },
      {
        id: 4,
        type: 3,
        name: 'KAC 2023 エンジョイコース【夢吹】',
        level: 0,
        nameID: 19,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1807,
            mty: 1
          },
          {
            no: 1,
            mid: 1591,
            mty: 1
          },
          {
            no: 2,
            mid: 1770,
            mty: 1
          }
        ]
      }
    ]
  },
  {
    id: 17,
    name: 'SKILL ANALYZER 第7回',
    version: 20230912,
    isNew: 0,
    hasGod: 1,
    courses: [
      {
        id: 1,
        type: 0,
        name: 'SKILL ANALYZER Level.01',
        level: 1,
        nameID: 1,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1018,
            mty: 0,
          },
          {
            no: 1,
            mid: 231,
            mty: 1,
          },
          {
            no: 2,
            mid: 1734,
            mty: 0,
          },
        ],
      },
      {
        id: 2,
        type: 0,
        name: 'SKILL ANALYZER Level.02',
        level: 2,
        nameID: 2,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 278,
            mty: 1,
          },
          {
            no: 1,
            mid: 919,
            mty: 1,
          },
          {
            no: 2,
            mid: 92,
            mty: 1,
          },
        ],
      },
      {
        id: 3,
        type: 0,
        name: 'SKILL ANALYZER Level.03',
        level: 3,
        nameID: 3,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 603,
            mty: 1,
          },
          {
            no: 1,
            mid: 898,
            mty: 1,
          },
          {
            no: 2,
            mid: 80,
            mty: 1,
          },
        ],
      },
      {
        id: 4,
        type: 0,
        name: 'SKILL ANALYZER Level.04',
        level: 4,
        nameID: 4,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 966,
            mty: 1,
          },
          {
            no: 1,
            mid: 983,
            mty: 1,
          },
          {
            no: 2,
            mid: 797,
            mty: 1,
          },
        ],
      },
      {
        id: 5,
        type: 0,
        name: 'SKILL ANALYZER Level.05',
        level: 5,
        nameID: 5,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 345,
            mty: 1,
          },
          {
            no: 1,
            mid: 1820,
            mty: 1,
          },
          {
            no: 2,
            mid: 1192,
            mty: 1,
          },
        ],
      },
      {
        id: 6,
        type: 0,
        name: 'SKILL ANALYZER Level.06',
        level: 6,
        nameID: 6,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 998,
            mty: 2,
          },
          {
            no: 1,
            mid: 1918,
            mty: 2,
          },
          {
            no: 2,
            mid: 115,
            mty: 2,
          },
        ],
      },
      {
        id: 7,
        type: 0,
        name: 'SKILL ANALYZER Level.07',
        level: 7,
        nameID: 7,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1842,
            mty: 2,
          },
          {
            no: 1,
            mid: 480,
            mty: 3,
          },
          {
            no: 2,
            mid: 361,
            mty: 2,
          },
        ],
      },
      {
        id: 8,
        type: 0,
        name: 'SKILL ANALYZER Level.08',
        level: 8,
        nameID: 8,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 528,
            mty: 2,
          },
          {
            no: 1,
            mid: 1841,
            mty: 2,
          },
          {
            no: 2,
            mid: 272,
            mty: 2,
          },
        ],
      },
      {
        id: 9,
        type: 0,
        name: 'SKILL ANALYZER Level.09',
        level: 9,
        nameID: 9,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 560,
            mty: 2,
          },
          {
            no: 1,
            mid: 1471,
            mty: 4,
          },
          {
            no: 2,
            mid: 1801,
            mty: 4,
          },
        ],
      },
      {
        id: 10,
        type: 0,
        name: 'SKILL ANALYZER Level.10',
        level: 10,
        nameID: 10,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1962,
            mty: 4,
          },
          {
            no: 1,
            mid: 1008,
            mty: 4,
          },
          {
            no: 2,
            mid: 617,
            mty: 2,
          },
        ],
      },
      {
        id: 11,
        type: 1,
        name: 'SKILL ANALYZER Level.11',
        level: 11,
        nameID: 11,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1499,
            mty: 4,
          },
          {
            no: 1,
            mid: 1037,
            mty: 4,
          },
          {
            no: 2,
            mid: 1708,
            mty: 4,
          },
        ],
      },
      {
        id: 12,
        type: 1,
        name: 'SKILL ANALYZER Level.∞',
        level: 12,
        nameID: 12,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 525,
            mty: 3,
          },
          {
            no: 1,
            mid: 1940,
            mty: 4,
          },
          {
            no: 2,
            mid: 2038,
            mty: 4,
          },
        ],
      },
    ]
  },
  {
    id: 18,
    name: 'SKILL ANALYZER 第8回',
    version: 20231205,
    isNew: 0,
    hasGod: 1,
    courses: [
      {
        id: 1,
        type: 0,
        name: 'SKILL ANALYZER Level.01',
        level: 1,
        nameID: 1,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1211,
            mty: 0,
          },
          {
            no: 1,
            mid: 781,
            mty: 1,
          },
          {
            no: 2,
            mid: 922,
            mty: 0,
          },
        ],
      },
      {
        id: 2,
        type: 0,
        name: 'SKILL ANALYZER Level.02',
        level: 2,
        nameID: 2,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 191,
            mty: 1,
          },
          {
            no: 1,
            mid: 520,
            mty: 1,
          },
          {
            no: 2,
            mid: 1740,
            mty: 1,
          },
        ],
      },
      {
        id: 3,
        type: 0,
        name: 'SKILL ANALYZER Level.03',
        level: 3,
        nameID: 3,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 397,
            mty: 1,
          },
          {
            no: 1,
            mid: 1233,
            mty: 1,
          },
          {
            no: 2,
            mid: 1387,
            mty: 1,
          },
        ],
      },
      {
        id: 4,
        type: 0,
        name: 'SKILL ANALYZER Level.04',
        level: 4,
        nameID: 4,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 724,
            mty: 1,
          },
          {
            no: 1,
            mid: 829,
            mty: 1,
          },
          {
            no: 2,
            mid: 752,
            mty: 1,
          },
        ],
      },
      {
        id: 5,
        type: 0,
        name: 'SKILL ANALYZER Level.05',
        level: 5,
        nameID: 5,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1618,
            mty: 1,
          },
          {
            no: 1,
            mid: 740,
            mty: 1,
          },
          {
            no: 2,
            mid: 1795,
            mty: 1,
          },
        ],
      },
      {
        id: 6,
        type: 0,
        name: 'SKILL ANALYZER Level.06',
        level: 6,
        nameID: 6,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1123,
            mty: 2,
          },
          {
            no: 1,
            mid: 1876,
            mty: 2,
          },
          {
            no: 2,
            mid: 968,
            mty: 2,
          },
        ],
      },
      {
        id: 7,
        type: 0,
        name: 'SKILL ANALYZER Level.07',
        level: 7,
        nameID: 7,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1094,
            mty: 2,
          },
          {
            no: 1,
            mid: 1167,
            mty: 2,
          },
          {
            no: 2,
            mid: 521,
            mty: 2,
          },
        ],
      },
      {
        id: 8,
        type: 0,
        name: 'SKILL ANALYZER Level.08',
        level: 8,
        nameID: 8,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 955,
            mty: 4,
          },
          {
            no: 1,
            mid: 855,
            mty: 2,
          },
          {
            no: 2,
            mid: 1682,
            mty: 2,
          },
        ],
      },
      {
        id: 9,
        type: 0,
        name: 'SKILL ANALYZER Level.09',
        level: 9,
        nameID: 9,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1677,
            mty: 4,
          },
          {
            no: 1,
            mid: 1437,
            mty: 2,
          },
          {
            no: 2,
            mid: 2036,
            mty: 4,
          },
        ],
      },
      {
        id: 10,
        type: 0,
        name: 'SKILL ANALYZER Level.10',
        level: 10,
        nameID: 10,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1803,
            mty: 4,
          },
          {
            no: 1,
            mid: 873,
            mty: 2,
          },
          {
            no: 2,
            mid: 362,
            mty: 2,
          },
        ],
      },
      {
        id: 11,
        type: 1,
        name: 'SKILL ANALYZER Level.11',
        level: 11,
        nameID: 11,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1930,
            mty: 4,
          },
          {
            no: 1,
            mid: 1843,
            mty: 4,
          },
          {
            no: 2,
            mid: 1276,
            mty: 4,
          },
        ],
      },
      {
        id: 12,
        type: 1,
        name: 'SKILL ANALYZER Level.∞',
        level: 12,
        nameID: 12,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 258,
            mty: 3,
          },
          {
            no: 1,
            mid: 1582,
            mty: 4,
          },
          {
            no: 2,
            mid: 2085,
            mty: 4,
          },
        ],
      },
    ]
  },
  {
    id: 19,
    name: 'SKILL ANALYZER 第9回',
    version: 20241008,
    isNew: 1,
    hasGod: 1,
    courses: [
      {
        id: 1,
        type: 0,
        name: 'SKILL ANALYZER Level.01',
        level: 1,
        nameID: 1,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 2169,
            mty: 0,
          },
          {
            no: 1,
            mid: 987 ,
            mty: 1,
          },
          {
            no: 2,
            mid: 185,
            mty: 1,
          },
        ],
      },
      {
        id: 2,
        type: 0,
        name: 'SKILL ANALYZER Level.02',
        level: 2,
        nameID: 2,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 446,
            mty: 1,
          },
          {
            no: 1,
            mid: 1064,
            mty: 1,
          },
          {
            no: 2,
            mid: 571,
            mty: 1,
          },
        ],
      },
      {
        id: 3,
        type: 0,
        name: 'SKILL ANALYZER Level.03',
        level: 3,
        nameID: 3,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 729,
            mty: 1,
          },
          {
            no: 1,
            mid: 1652,
            mty: 1,
          },
          {
            no: 2,
            mid: 55,
            mty: 1,
          },
        ],
      },
      {
        id: 4,
        type: 0,
        name: 'SKILL ANALYZER Level.04',
        level: 4,
        nameID: 4,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 519,
            mty: 1,
          },
          {
            no: 1,
            mid: 736,
            mty: 1,
          },
          {
            no: 2,
            mid: 1045,
            mty: 1,
          },
        ],
      },
      {
        id: 5,
        type: 0,
        name: 'SKILL ANALYZER Level.05',
        level: 5,
        nameID: 5,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1255,
            mty: 1,
          },
          {
            no: 1,
            mid: 753,
            mty: 2,
          },
          {
            no: 2,
            mid: 165,
            mty: 2,
          },
        ],
      },
      {
        id: 6,
        type: 0,
        name: 'SKILL ANALYZER Level.06',
        level: 6,
        nameID: 6,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1537,
            mty: 2,
          },
          {
            no: 1,
            mid: 104,
            mty: 2,
          },
          {
            no: 2,
            mid: 1284,
            mty: 2,
          },
        ],
      },
      {
        id: 7,
        type: 0,
        name: 'SKILL ANALYZER Level.07',
        level: 7,
        nameID: 7,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1804,
            mty: 2,
          },
          {
            no: 1,
            mid: 2105,
            mty: 2,
          },
          {
            no: 2,
            mid: 62,
            mty: 2,
          },
        ],
      },
      {
        id: 8,
        type: 0,
        name: 'SKILL ANALYZER Level.08',
        level: 8,
        nameID: 8,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1421,
            mty: 2,
          },
          {
            no: 1,
            mid: 2016,
            mty: 2,
          },
          {
            no: 2,
            mid: 97,
            mty: 2,
          },
        ],
      },
      {
        id: 9,
        type: 0,
        name: 'SKILL ANALYZER Level.09',
        level: 9,
        nameID: 9,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1885,
            mty: 2,
          },
          {
            no: 1,
            mid: 1443,
            mty: 4,
          },
          {
            no: 2,
            mid: 2104,
            mty: 4,
          },
        ],
      },
      {
        id: 10,
        type: 0,
        name: 'SKILL ANALYZER Level.10',
        level: 10,
        nameID: 10,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 2026,
            mty: 4,
          },
          {
            no: 1,
            mid: 1633,
            mty: 4,
          },
          {
            no: 2,
            mid: 479,
            mty: 2,
          },
        ],
      },
      {
        id: 11,
        type: 1,
        name: 'SKILL ANALYZER Level.11',
        level: 11,
        nameID: 11,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1632,
            mty: 4,
          },
          {
            no: 1,
            mid: 650,
            mty: 3,
          },
          {
            no: 2,
            mid: 2132,
            mty: 4,
          },
        ],
      },
      {
        id: 12,
        type: 1,
        name: 'SKILL ANALYZER Level.∞',
        level: 12,
        nameID: 12,
        assist: 0,
        tracks: [
          {
            no: 0,
            mid: 1892,
            mty: 4,
          },
          {
            no: 1,
            mid: 1906,
            mty: 4,
          },
          {
            no: 2,
            mid: 2087,
            mty: 4,
          },
        ],
      },
    ]
  }
]

export const INFORMATION6 = [
  { id: 23, version: 20240318, start: 0, str: '[img:info/240321_info_generator4.png:]'},
  { id: 24, version: 20240604, start: 0, str: '[img:info/240606_watame.png:]'},
  { id: 25, version: 20240805, start: 0, str: '[img:info/240807_toho2024.png:]'},
  { id: 26, version: 20240827, start: 0, str: '[img:info/240829_info_generator5.png:]'},
  { id: 27, version: 20240924, start: 0, str: '[img:info/240926_generator.png: 106, 0]'},
  { id: 28, version: 20240924, start: 0, str: '[img:info/240926_re_generator.png: 106, 0]'},
  { id: 29, version: 20241008, start: 0, str: '[img:info/241010_hexadiver.png:]'},
  { id: 30, version: 20241105, start: 0, str: '[img:info/241108_paseli.png:]'},
  { id: 31, version: 20241105, start: 0, str: '[img:info/241107_marine_info.png:]'},
  { id: 32, version: 20250212, start: 0, str: '[img:info/250214_hinabita_meu.jpg:]'},
  { id: 33, version: 20250218, start: 0, str: '[img:info/250220_generator_pekora.jpg:]'},
  { id: 34, version: 20250225, start: 0, str: '[img:info/250303_paseli.png:]'},
  { id: 35, version: 20250324, start: 0, str: '[img:info/250326_noah.jpg:]'},
  { id: 36, version: 20250422, start: 0, str: '[img:info/250422_info_ichika.png:]'},
  { id: 37, version: 20250422, start: 0, str: '[img:info/250501_info_cross_resonance.png:]'},
  { id: 38, version: 20250624, start: 0, str: '[img:info/250626_info_generator6.png:]'},
  { id: 39, version: 20250624, start: 0, str: '[img:info/250626_info_sumire.png:]'},
  { id: 40, version: 20250826, start: 0, str: '[img:info/250828_info_sena.png:]'},
  { id: 41, version: 20250924, start: 0, str: '[img:info/250926_info_cross_resonance.png:]'},
  { id: 42, version: 20250924, start: 0, str: '[img:info/250929_info_regloss.png:]'}
] 

export const MEGAMIX_SONGS = [
  6, 75, 86, 87, 94, 115, 116, 117, 118, 120, 121, 122, 123, 124, 125, 126, 128, 134, 251, 253, 258, 259, 
  271, 272, 304, 344, 357, 358, 359, 360, 361, 362, 363, 364, 365, 366, 367, 368, 369, 370, 372, 373, 374, 
  375, 376, 377, 381, 437, 479, 495, 538, 542, 543, 546, 553, 581, 607, 625, 626, 632, 633, 634, 635, 636, 
  637, 638, 639, 640, 641, 642, 643, 644, 645, 646, 647, 648, 649, 650, 651, 652, 653, 654, 655, 656, 657, 
  658, 659, 673, 679, 692, 693, 694, 698, 699, 704, 708, 709, 715, 716, 718, 786, 787, 788, 789, 790, 791, 
  792, 793, 794, 795, 796, 797, 798, 799, 800, 801, 802, 803, 804, 805, 806, 807, 808, 809, 810, 811, 812, 
  813, 814, 815, 816, 817, 818, 823, 825, 827, 828, 829, 830, 831, 842, 866, 900, 902, 907, 908, 909, 910, 
  911, 912, 913, 914, 915, 927, 929, 979, 1022, 1023, 1024, 1025, 1026, 1027, 1028, 1029, 1030, 1031, 1032, 
  1033, 1034, 1035, 1036, 1037, 1038, 1039, 1040, 1041, 1042, 1043, 1044, 1045, 1046, 1047, 1048, 1049, 1072, 
  1099, 1100, 1101, 1102, 1103, 1104, 1105, 1106, 1107, 1108, 1117, 1140, 1141, 1142, 1143, 1144, 1145, 1146,
  1147, 1148, 1176, 1177, 1178, 1179, 1180, 1181, 1183, 1184, 1185, 1186, 1187, 1188, 1189, 1190, 1191, 1192, 
  1193, 1194, 1195, 1196, 1197, 1198, 1199, 1200, 1201, 1202, 1203, 1204, 1205, 1206, 1207, 1208
]

export const MEGAMIX_SONGS_2 = [
  1209, 1210, 1211, 1212, 1213, 1214, 1215, 1216, 1217, 1218, 1220, 1221, 1260, 1269, 1270, 1271, 1272, 1273,
  1274, 1275, 1276, 1277, 1278, 1279, 1280, 1281, 1282, 1300, 1301, 1302, 1329, 1345, 1346, 1347, 1348, 1361,
  1362, 1363, 1364, 1365, 1366, 1367, 1368, 1369, 1370, 1371, 1372, 1373, 1374, 1375, 1376, 1377, 1378, 1379,
  1380, 1381, 1382, 1383, 1384, 1385, 1386, 1433, 1434, 1435, 1436, 1437, 1459, 1460, 1461, 1462, 1463, 1464,
  1465, 1466, 1467, 1468, 1490, 1491, 1495, 1496, 1497, 1498, 1499, 1500, 1501, 1580, 1581, 1582, 1583, 1584,
  1585, 1586, 1587, 1588, 1589, 1590, 1591, 1592, 1593, 1594, 1595, 1596, 1597, 1598, 1599, 1600, 1601, 1602,
  1603, 1604, 1605, 1606, 1607, 1608, 1609, 1610, 1611, 1660, 1661, 1662, 1663, 1664, 1665, 1666, 1838, 1839,
  1840, 1841, 1842, 1843, 1844, 99001, 99002, 99003, 99004, 1, 2, 3, 4, 5, 7, 8, 9, 10, 11, 12, 13, 14, 15, 
  16, 17, 18, 19, 21, 22, 23, 24, 30, 36, 39, 47, 60, 63, 71, 73, 88, 89, 90, 91, 101, 109, 130, 131, 135, 
  151, 165, 166, 180, 183, 198, 208, 211, 213, 214, 216, 220, 221, 223, 228, 229, 239, 247, 250, 252, 255, 
  256, 267, 269, 282, 289, 295, 299, 324, 332, 333, 339, 341, 342, 348, 393, 398, 408, 413, 414, 418, 420, 
  432, 444, 459, 499, 506, 507, 508, 510, 522, 525, 529
]

export const MEGAMIX_SONGS_3 = [
  532, 535, 537, 540, 547, 548, 550, 551, 583, 587, 597, 598, 600, 606, 610, 615, 623, 629, 680, 681, 
  689, 717, 720, 722, 725, 730, 731, 733, 735, 740, 741, 743, 746, 783, 784, 785, 819, 837, 883, 888, 
  889, 895, 925, 939, 961, 963, 964, 965, 966, 967, 968, 969, 970, 971, 977, 978, 982, 983, 985, 986, 
  992, 993, 994, 995, 998, 999, 1000, 1008, 1009, 1010, 1011, 1012, 1013, 1015, 1017, 1018, 1021, 1052, 
  1055, 1121, 1149, 1152, 1158, 1226, 1228, 1230, 1231, 1235, 1237, 1238, 1239, 1240, 1243, 1244, 1246, 
  1247, 1248, 1250, 1251, 1252, 1253, 1254, 1255, 1257, 1258, 1261, 1304, 1306, 1307, 1308, 1309, 1310, 
  1311, 1312, 1313, 1314, 1315, 1388, 1389, 1397, 1402, 1416, 1509, 1766, 1767, 1768, 1769, 1770, 1771, 
  1772, 1773, 1774, 1775, 1776, 1777, 1778, 1779, 1780, 1781, 1782, 1783, 1784, 1785, 1786, 1787, 1788, 
  1789, 1790, 1791, 1792, 1793, 1794, 1795, 1796, 1797, 1798, 1799, 1800, 1801, 1888, 1889, 1890, 1891, 
  1892, 1893, 1894, 1895, 1896, 1897, 1898, 1899, 1900, 1901, 1919, 1920, 1921, 1922, 1923, 1924, 1925, 
  1926, 1927, 1928, 1929, 1930, 1931, 1932, 1933, 1934, 1935, 1936, 1937, 1938, 1939, 1940, 1941, 1942, 
  1943, 1944, 1945, 1946, 1947, 1948, 1949, 1950, 1951, 1952, 1953, 1954, 1955, 1956, 1957, 1958
]

export const MEGAMIX_SONGS_4 = [
  59, 61, 62, 64, 68, 69, 70, 496, 497, 498, 500, 501, 502, 503, 504, 505, 509, 511, 512, 513, 
  514, 515, 516, 517, 518, 519, 975, 976, 1123, 1124, 1125, 1126, 1127, 1128, 2037, 2038, 2039,
  2040, 2041, 2042, 2043, 2044, 2045, 2046, 2047, 2048, 2049, 2050, 2121, 2122, 2123, 2124, 2125,
  2126, 2127, 2128, 2129, 2130, 2131, 2132, 2133, 2134, 2135, 2136, 2137, 2138, 2139, 2140, 2141,
  2142, 2143, 2144, 2145, 2146, 2147, 2148, 2149, 2150, 2151, 2152, 2153, 2154, 2155, 2156, 2157,
  2158, 2159, 2160, 2161, 2085, 2083, 2084, 2079, 2080, 2081, 2082, 2087, 2086, 2088, 2089, 2090, 
  2091, 2092, 2093, 2094, 2095, 2096, 2097, 2098, 2099, 2100, 2101, 2102, 2103, 2104, 2105, 2106,
  2107, 2108, 2109, 2110, 2111, 2112, 2113, 2114, 2115, 2116, 2117, 2118, 2198, 2201, 2202, 2200, 
  2203, 2204, 44, 241, 315, 389, 390, 711, 880, 1525, 1617, 1692, 1699, 1672, 1744, 1855, 1742, 1743, 
  1902, 1745, 1846, 931, 1735, 1812, 1822, 2210, 2211, 2212, 2229, 2176, 182, 426, 439, 463, 685, 1819,
  322, 465, 1068, 1070, 1342, 1867, 1917, 2030, 2228, 1918, 1739, 1740, 1741, 1871, 1872, 2028, 2029, 
  2069, 2070, 2071, 2072, 2073, 2165, 2166, 2167, 2172, 2173, 2174, 2175, 2194, 2195, 2196, 2197, 2205, 
  2206, 2207, 2208, 1657, 1960, 1962, 2287, 2288, 2289, 2290, 2291
]

export const EXTENDS6 = [
  {
    version: 20230807,
    start: 20230809,
    type: 6,
    id: 101,
    params: [
      0,0,0,0,0,
      "kac:16,1,3",
      "",
      "",
      "",
      ""
    ]
  },
  {
    version: 20250218,
    start: 20250225,
    type: 21,
    id: 0,
    params: [
      0, 0, 0, 0, 0,
      "demo/250225_pekora_demo.mp4",
      "demo/250225_pekora_demo.s3v",
      "",
      "",
      ""
    ]
  },
  {
    version: 20241105,
    start: 20241107,
    type: 21,
    id: 0,
    params: [
      0, 0, 0, 0, 0,
      "538/241107_marine_demo.mp4",
      "538/241107_marine_demo.s3v",
      "",
      "",
      ""
    ]
  },
  {
    version: 0,
    start: 0,
    id: 91,
    type: 17,
    params: [
      0, 0, 0, 0, 0,
      MEGAMIX_SONGS.join(','),
      '',
      '',
      '',
      '',
    ],
  },
  {
    version: 0,
    start: 0,
    id: 92,
    type: 17,
    params: [
      0, 0, 0, 0, 0,
      MEGAMIX_SONGS_2.join(','),
      '',
      '',
      '',
      '',
    ],
  },
  {
    version: 0,
    start: 0,
    id: 93,
    type: 17,
    params: [
      0, 0, 0, 0, 0,
      MEGAMIX_SONGS_3.join(','),
      '',
      '',
      '',
      '',
    ],
  },
  {
    version: 0,
    start: 0,
    id: 94,
    type: 17,
    params: [
      0, 0, 0, 0, 0,
      MEGAMIX_SONGS_4.join(','),
      '',
      '',
      '',
      '',
    ],
  }
]

export const MUSIC_OVERRIDE6 = []